zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
/**
  ******************************************************************************
  * @file    stm32wb07_06_events.c
  * @author  System Research & Applications Team - Agrate/Catania Lab.
  * @version 1.0.0
  * @date    04-March-2025
  * @brief   Source file for external uC - stm32wb07_06 in network coprocessor mode
  *          (Event callbacks). Autogenerated files, do not edit!!
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */

#include <stdint.h>
#include "stm32wb07_06_events.h"
#include "stm32wb07_06_conf.h"

ble_status_t hci_disconnection_complete_event_process(uint8_t *buffer_in);
ble_status_t hci_encryption_change_event_process(uint8_t *buffer_in);
ble_status_t hci_read_remote_version_information_complete_event_process(uint8_t *buffer_in);
ble_status_t hci_hardware_error_event_process(uint8_t *buffer_in);
ble_status_t hci_number_of_completed_packets_event_process(uint8_t *buffer_in);
ble_status_t hci_data_buffer_overflow_event_process(uint8_t *buffer_in);
ble_status_t hci_encryption_key_refresh_complete_event_process(uint8_t *buffer_in);
ble_status_t hci_authenticated_payload_timeout_expired_event_process(uint8_t *buffer_in);
ble_status_t aci_blue_initialized_event_process(uint8_t *buffer_in);
ble_status_t aci_blue_events_lost_event_process(uint8_t *buffer_in);
ble_status_t aci_blue_crash_info_event_process(uint8_t *buffer_in);
ble_status_t aci_hal_end_of_radio_activity_event_process(uint8_t *buffer_in);
ble_status_t aci_hal_scan_req_report_event_process(uint8_t *buffer_in);
ble_status_t aci_hal_fw_error_event_process(uint8_t *buffer_in);
ble_status_t aci_hal_le_test_end_event_process(uint8_t *buffer_in);
ble_status_t aci_gap_limited_discoverable_event_process(uint8_t *buffer_in);
ble_status_t aci_gap_pairing_complete_event_process(uint8_t *buffer_in);
ble_status_t aci_gap_pass_key_req_event_process(uint8_t *buffer_in);
ble_status_t aci_gap_slave_security_initiated_event_process(uint8_t *buffer_in);
ble_status_t aci_gap_bond_lost_event_process(uint8_t *buffer_in);
ble_status_t aci_gap_proc_complete_event_process(uint8_t *buffer_in);
ble_status_t aci_gap_addr_not_resolved_event_process(uint8_t *buffer_in);
ble_status_t aci_gap_numeric_comparison_value_event_process(uint8_t *buffer_in);
ble_status_t aci_gap_keypress_notification_event_process(uint8_t *buffer_in);
ble_status_t aci_l2cap_connection_update_resp_event_process(uint8_t *buffer_in);
ble_status_t aci_l2cap_proc_timeout_event_process(uint8_t *buffer_in);
ble_status_t aci_l2cap_connection_update_req_event_process(uint8_t *buffer_in);
ble_status_t aci_l2cap_cfc_connection_event_process(uint8_t *buffer_in);
ble_status_t aci_l2cap_disconnection_complete_event_process(uint8_t *buffer_in);
ble_status_t aci_l2cap_flow_control_credit_event_process(uint8_t *buffer_in);
ble_status_t aci_l2cap_sdu_data_tx_nwk_event_process(uint8_t *buffer_in);
ble_status_t aci_l2cap_sdu_data_rx_nwk_event_process(uint8_t *buffer_in);
ble_status_t aci_l2cap_command_reject_event_process(uint8_t *buffer_in);
ble_status_t aci_gatt_srv_attribute_modified_event_process(uint8_t *buffer_in);
ble_status_t aci_gatt_proc_timeout_event_process(uint8_t *buffer_in);
ble_status_t aci_att_exchange_mtu_resp_event_process(uint8_t *buffer_in);
ble_status_t aci_att_clt_find_info_resp_event_process(uint8_t *buffer_in);
ble_status_t aci_att_clt_find_by_type_value_resp_event_process(uint8_t *buffer_in);
ble_status_t aci_att_clt_read_by_type_resp_event_process(uint8_t *buffer_in);
ble_status_t aci_att_clt_read_resp_event_process(uint8_t *buffer_in);
ble_status_t aci_att_clt_read_blob_resp_event_process(uint8_t *buffer_in);
ble_status_t aci_att_clt_read_multiple_resp_event_process(uint8_t *buffer_in);
ble_status_t aci_att_clt_read_by_group_type_resp_event_process(uint8_t *buffer_in);
ble_status_t aci_att_clt_prepare_write_resp_event_process(uint8_t *buffer_in);
ble_status_t aci_att_clt_exec_write_resp_event_process(uint8_t *buffer_in);
ble_status_t aci_gatt_clt_indication_event_process(uint8_t *buffer_in);
ble_status_t aci_gatt_clt_notification_event_process(uint8_t *buffer_in);
ble_status_t aci_gatt_clt_proc_complete_event_process(uint8_t *buffer_in);
ble_status_t aci_gatt_clt_error_resp_event_process(uint8_t *buffer_in);
ble_status_t aci_gatt_clt_disc_read_char_by_uuid_resp_event_process(uint8_t *buffer_in);
ble_status_t aci_gatt_tx_pool_available_event_process(uint8_t *buffer_in);
ble_status_t aci_gatt_srv_confirmation_event_process(uint8_t *buffer_in);
ble_status_t aci_att_srv_exec_write_req_event_process(uint8_t *buffer_in);
ble_status_t aci_gatt_srv_authorize_nwk_event_process(uint8_t *buffer_in);
ble_status_t hci_le_connection_complete_event_process(uint8_t *buffer_in);
ble_status_t hci_le_advertising_report_event_process(uint8_t *buffer_in);
ble_status_t hci_le_connection_update_complete_event_process(uint8_t *buffer_in);
ble_status_t hci_le_read_remote_used_features_complete_event_process(uint8_t *buffer_in);
ble_status_t hci_le_long_term_key_request_event_process(uint8_t *buffer_in);
ble_status_t hci_le_data_length_change_event_process(uint8_t *buffer_in);
ble_status_t hci_le_read_local_p256_public_key_complete_event_process(uint8_t *buffer_in);
ble_status_t hci_le_generate_dhkey_complete_event_process(uint8_t *buffer_in);
ble_status_t hci_le_enhanced_connection_complete_event_process(uint8_t *buffer_in);
ble_status_t hci_le_direct_advertising_report_event_process(uint8_t *buffer_in);
ble_status_t hci_le_phy_update_complete_event_process(uint8_t *buffer_in);
ble_status_t hci_le_extended_advertising_report_event_process(uint8_t *buffer_in);
ble_status_t hci_le_periodic_advertising_sync_established_event_process(uint8_t *buffer_in);
ble_status_t hci_le_periodic_advertising_report_event_process(uint8_t *buffer_in);
ble_status_t hci_le_periodic_advertising_sync_lost_event_process(uint8_t *buffer_in);
ble_status_t hci_le_scan_timeout_event_process(uint8_t *buffer_in);
ble_status_t hci_le_advertising_set_terminated_event_process(uint8_t *buffer_in);
ble_status_t hci_le_scan_request_received_event_process(uint8_t *buffer_in);
ble_status_t hci_le_channel_selection_algorithm_event_process(uint8_t *buffer_in);
ble_status_t hci_le_connectionless_iq_report_event_process(uint8_t *buffer_in);
ble_status_t hci_le_connection_iq_report_event_process(uint8_t *buffer_in);
ble_status_t hci_le_cte_request_failed_event_process(uint8_t *buffer_in);
ble_status_t hci_le_periodic_advertising_sync_transfer_received_event_process(uint8_t *buffer_in);
ble_status_t hci_le_path_loss_threshold_event_process(uint8_t *buffer_in);
ble_status_t hci_le_transmit_power_reporting_event_process(uint8_t *buffer_in);
const hci_events_table_type_t hci_events_table[8] =
{
  /* hci_disconnection_complete_event */
  {0x0005, hci_disconnection_complete_event_process},
  /* hci_encryption_change_event */
  {0x0008, hci_encryption_change_event_process},
  /* hci_read_remote_version_information_complete_event */
  {0x000c, hci_read_remote_version_information_complete_event_process},
  /* hci_hardware_error_event */
  {0x0010, hci_hardware_error_event_process},
  /* hci_number_of_completed_packets_event */
  {0x0013, hci_number_of_completed_packets_event_process},
  /* hci_data_buffer_overflow_event */
  {0x001a, hci_data_buffer_overflow_event_process},
  /* hci_encryption_key_refresh_complete_event */
  {0x0030, hci_encryption_key_refresh_complete_event_process},
  /* hci_authenticated_payload_timeout_expired_event */
  {0x0057, hci_authenticated_payload_timeout_expired_event_process}
};
const hci_le_meta_events_table_type_t hci_le_meta_events_table[25] =
{
  /* hci_le_connection_complete_event */
  {0x0001, hci_le_connection_complete_event_process},
  /* hci_le_advertising_report_event */
  {0x0002, hci_le_advertising_report_event_process},
  /* hci_le_connection_update_complete_event */
  {0x0003, hci_le_connection_update_complete_event_process},
  /* hci_le_read_remote_used_features_complete_event */
  {0x0004, hci_le_read_remote_used_features_complete_event_process},
  /* hci_le_long_term_key_request_event */
  {0x0005, hci_le_long_term_key_request_event_process},
  /* hci_le_data_length_change_event */
  {0x0007, hci_le_data_length_change_event_process},
  /* hci_le_read_local_p256_public_key_complete_event */
  {0x0008, hci_le_read_local_p256_public_key_complete_event_process},
  /* hci_le_generate_dhkey_complete_event */
  {0x0009, hci_le_generate_dhkey_complete_event_process},
  /* hci_le_enhanced_connection_complete_event */
  {0x000a, hci_le_enhanced_connection_complete_event_process},
  /* hci_le_direct_advertising_report_event */
  {0x000b, hci_le_direct_advertising_report_event_process},
  /* hci_le_phy_update_complete_event */
  {0x000c, hci_le_phy_update_complete_event_process},
  /* hci_le_extended_advertising_report_event */
  {0x000d, hci_le_extended_advertising_report_event_process},
  /* hci_le_periodic_advertising_sync_established_event */
  {0x000e, hci_le_periodic_advertising_sync_established_event_process},
  /* hci_le_periodic_advertising_report_event */
  {0x000f, hci_le_periodic_advertising_report_event_process},
  /* hci_le_periodic_advertising_sync_lost_event */
  {0x0010, hci_le_periodic_advertising_sync_lost_event_process},
  /* hci_le_scan_timeout_event */
  {0x0011, hci_le_scan_timeout_event_process},
  /* hci_le_advertising_set_terminated_event */
  {0x0012, hci_le_advertising_set_terminated_event_process},
  /* hci_le_scan_request_received_event */
  {0x0013, hci_le_scan_request_received_event_process},
  /* hci_le_channel_selection_algorithm_event */
  {0x0014, hci_le_channel_selection_algorithm_event_process},
  /* hci_le_connectionless_iq_report_event */
  {0x0015, hci_le_connectionless_iq_report_event_process},
  /* hci_le_connection_iq_report_event */
  {0x0016, hci_le_connection_iq_report_event_process},
  /* hci_le_cte_request_failed_event */
  {0x0017, hci_le_cte_request_failed_event_process},
  /* hci_le_periodic_advertising_sync_transfer_received_event */
  {0x0018, hci_le_periodic_advertising_sync_transfer_received_event_process},
  /* hci_le_path_loss_threshold_event */
  {0x0020, hci_le_path_loss_threshold_event_process},
  /* hci_le_transmit_power_reporting_event */
  {0x0021, hci_le_transmit_power_reporting_event_process}
};
