zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
const hci_vendor_specific_events_table_type_t hci_vendor_specific_events_table[46] =
{
  /* aci_blue_initialized_event */
  {0x0001, aci_blue_initialized_event_process},
  /* aci_blue_events_lost_event */
  {0x0002, aci_blue_events_lost_event_process},
  /* aci_blue_crash_info_event */
  {0x0003, aci_blue_crash_info_event_process},
  /* aci_hal_end_of_radio_activity_event */
  {0x0004, aci_hal_end_of_radio_activity_event_process},
  /* aci_hal_scan_req_report_event */
  {0x0005, aci_hal_scan_req_report_event_process},
  /* aci_hal_fw_error_event */
  {0x0006, aci_hal_fw_error_event_process},
  /* aci_hal_le_test_end_event */
  {0x0007, aci_hal_le_test_end_event_process},
  /* aci_gap_limited_discoverable_event */
  {0x0400, aci_gap_limited_discoverable_event_process},
  /* aci_gap_pairing_complete_event */
  {0x0401, aci_gap_pairing_complete_event_process},
  /* aci_gap_pass_key_req_event */
  {0x0402, aci_gap_pass_key_req_event_process},
  /* aci_gap_slave_security_initiated_event */
  {0x0404, aci_gap_slave_security_initiated_event_process},
  /* aci_gap_bond_lost_event */
  {0x0405, aci_gap_bond_lost_event_process},
  /* aci_gap_proc_complete_event */
  {0x0407, aci_gap_proc_complete_event_process},
  /* aci_gap_addr_not_resolved_event */
  {0x0408, aci_gap_addr_not_resolved_event_process},
  /* aci_gap_numeric_comparison_value_event */
  {0x0409, aci_gap_numeric_comparison_value_event_process},
  /* aci_gap_keypress_notification_event */
  {0x040a, aci_gap_keypress_notification_event_process},
  /* aci_l2cap_connection_update_resp_event */
  {0x0800, aci_l2cap_connection_update_resp_event_process},
  /* aci_l2cap_proc_timeout_event */
  {0x0801, aci_l2cap_proc_timeout_event_process},
  /* aci_l2cap_connection_update_req_event */
  {0x0802, aci_l2cap_connection_update_req_event_process},
  /* aci_l2cap_cfc_connection_event */
  {0x0803, aci_l2cap_cfc_connection_event_process},
  /* aci_l2cap_disconnection_complete_event */
  {0x0804, aci_l2cap_disconnection_complete_event_process},
  /* aci_l2cap_flow_control_credit_event */
  {0x0805, aci_l2cap_flow_control_credit_event_process},
  /* aci_l2cap_sdu_data_tx_nwk_event */
  {0x0806, aci_l2cap_sdu_data_tx_nwk_event_process},
  /* aci_l2cap_sdu_data_rx_nwk_event */
  {0x0807, aci_l2cap_sdu_data_rx_nwk_event_process},
  /* aci_l2cap_command_reject_event */
  {0x080a, aci_l2cap_command_reject_event_process},
  /* aci_gatt_srv_attribute_modified_event */
  {0x0c01, aci_gatt_srv_attribute_modified_event_process},
  /* aci_gatt_proc_timeout_event */
  {0x0c02, aci_gatt_proc_timeout_event_process},
  /* aci_att_exchange_mtu_resp_event */
  {0x0c03, aci_att_exchange_mtu_resp_event_process},
  /* aci_att_clt_find_info_resp_event */
  {0x0c04, aci_att_clt_find_info_resp_event_process},
  /* aci_att_clt_find_by_type_value_resp_event */
  {0x0c05, aci_att_clt_find_by_type_value_resp_event_process},
  /* aci_att_clt_read_by_type_resp_event */
  {0x0c06, aci_att_clt_read_by_type_resp_event_process},
  /* aci_att_clt_read_resp_event */
  {0x0c07, aci_att_clt_read_resp_event_process},
  /* aci_att_clt_read_blob_resp_event */
  {0x0c08, aci_att_clt_read_blob_resp_event_process},
  /* aci_att_clt_read_multiple_resp_event */
  {0x0c09, aci_att_clt_read_multiple_resp_event_process},
  /* aci_att_clt_read_by_group_type_resp_event */
  {0x0c0a, aci_att_clt_read_by_group_type_resp_event_process},
  /* aci_att_clt_prepare_write_resp_event */
  {0x0c0c, aci_att_clt_prepare_write_resp_event_process},
  /* aci_att_clt_exec_write_resp_event */
  {0x0c0d, aci_att_clt_exec_write_resp_event_process},
  /* aci_gatt_clt_indication_event */
  {0x0c0e, aci_gatt_clt_indication_event_process},
  /* aci_gatt_clt_notification_event */
  {0x0c0f, aci_gatt_clt_notification_event_process},
  /* aci_gatt_clt_proc_complete_event */
  {0x0c10, aci_gatt_clt_proc_complete_event_process},
  /* aci_gatt_clt_error_resp_event */
  {0x0c11, aci_gatt_clt_error_resp_event_process},
  /* aci_gatt_clt_disc_read_char_by_uuid_resp_event */
  {0x0c12, aci_gatt_clt_disc_read_char_by_uuid_resp_event_process},
  /* aci_gatt_tx_pool_available_event */
  {0x0c16, aci_gatt_tx_pool_available_event_process},
  /* aci_gatt_srv_confirmation_event */
  {0x0c17, aci_gatt_srv_confirmation_event_process},
  /* aci_att_srv_exec_write_req_event */
  {0x0c1c, aci_att_srv_exec_write_req_event_process},
  /* aci_gatt_srv_authorize_nwk_event */
  {0x0c1d, aci_gatt_srv_authorize_nwk_event_process}
};
/* hci_disconnection_complete_event */
/* Event len: 1 + 2 + 1 */
/**
  * @brief The Disconnection Complete event occurs when a connection is
  *        terminated. The status parameter indicates if the disconnection was
  *        successful or not. The reason parameter indicates the reason for the
  *        disconnection if the disconnection was successful. If the
  *        disconnection was not successful, the value of the reason parameter
  *        can be ignored by the Host. For example, this can be the case if the
  *        Host has issued the Disconnect command and there was a parameter
  *        error, or the command was not presently allowed, or a
  *        connection_handle that didn't correspond to a connection was given.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param connection_handle connection_handle which was disconnected.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param reason reason for disconnection. See Error Codes.
  * @retval None
  */

ble_status_t hci_disconnection_complete_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_disconnection_complete_event_rp0 *rp0 = (hci_disconnection_complete_event_rp0 *)buffer_in;
  hci_disconnection_complete_event(rp0->status,
                                   rp0->connection_handle,
                                   rp0->reason);

  return status;
}
/* hci_encryption_change_event */
/* Event len: 1 + 2 + 1 */
/**
  * @brief The Encryption Change event is used to indicate that the change of the
  *        encryption mode has been completed. The connection_handle will be a
  *        connection_handle for an ACL connection. The encryption_enabled event
  *        parameter specifies the new encryption_enabled parameter for the
  *        connection_handle specified by the connection_handle event parameter.
  *        This event will occur on both devices to notify the Hosts when
  *        Encryption has changed for the specified connection_handle between two
  *        devices. Note: This event shall not be generated if encryption is
  *        paused or resumed; during a role switch, for example. The meaning of
  *        the encryption_enabled parameter depends on whether the Host has
  *        indicated support for Secure Connections in the
  *        Secure_Connections_Host_Support parameter. When
  *        Secure_Connections_Host_Support is 'disabled' or the connection_handle
  *        refers to an LE link, the Controller shall only use encryption_enabled
  *        values 0x00 (OFF) and 0x01 (ON). (See Bluetooth Specification v.4.1,
  *        Vol. 2, Part E, 7.7.8)
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param encryption_enabled Link Level Encryption.
  *        Values:
  *        - 0x00: Link Level Encryption OFF
  *        - 0x01: Link Level Encryption is ON with AES-CCM
  * @retval None
  */

ble_status_t hci_encryption_change_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_encryption_change_event_rp0 *rp0 = (hci_encryption_change_event_rp0 *)buffer_in;
  hci_encryption_change_event(rp0->status,
                              rp0->connection_handle,
                              rp0->encryption_enabled);

