zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
  return status;
}
/* hci_read_remote_version_information_complete_event */
/* Event len: 1 + 2 + 1 + 2 + 2 */
/**
  * @brief The Read Remote Version Information Complete event is used to indicate
  *        the completion of the process obtaining the version information of the
  *        remote Controller specified by the connection_handle event parameter.
  *        The connection_handle shall be for an ACL connection. The Version
  *        event parameter defines the specification version of the LE
  *        Controller. The manufacturer_name event parameter indicates the
  *        manufacturer of the remote Controller. The Subversion event parameter
  *        is controlled by the manufacturer and is implementation dependent. The
  *        Subversion event parameter defines the various revisions that each
  *        version of the Bluetooth hardware will go through as design processes
  *        change and errors are fixed. This allows the software to determine
  *        what Bluetooth hardware is being used and, if necessary, to work
  *        around various bugs in the hardware. When the connection_handle is
  *        associated with an LE-U logical link, the Version event parameter
  *        shall be Link Layer VersNr parameter, the manufacturer_name event
  *        parameter shall be the CompId parameter, and the Subversion event
  *        parameter shall be the SubVersNr parameter. (See Bluetooth
  *        Specification v.4.1, Vol. 2, Part E, 7.7.12)
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param version Version of the Current LMP in the remote Controller
  * @param manufacturer_name Manufacturer Name of the remote Controller
  * @param subversion Subversion of the LMP in the remote Controller
  * @retval None
  */

ble_status_t hci_read_remote_version_information_complete_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_read_remote_version_information_complete_event_rp0 *rp0 =
    (hci_read_remote_version_information_complete_event_rp0 *)buffer_in;
  hci_read_remote_version_information_complete_event(rp0->status,
                                                     rp0->connection_handle,
                                                     rp0->version,
                                                     rp0->manufacturer_name,
                                                     rp0->subversion);

  return status;
}
/* hci_hardware_error_event */
/* Event len: 1 */
/**
  * @brief The Hardware Error event is used to indicate some implementation
  *        specific type of hardware failure for the controller. This event is
  *        used to notify the Host that a hardware failure has occurred in the
  *        Controller.
  * @param hardware_code Error code 0x01 and 0x02 are errors generally caused by
  *        hardware issue on the PCB; another possible cause is a slow crystal
  *        startup. In the latter case, the HS_STARTUP_TIME in the device
  *        configuration needs to be tuned. Error code 0x03 indicates an internal
  *        error of the protocol stack. This event with error code 0x04 is raised
  *        when a radio interrupt is served late. This usually happens when
  *        interrupts are disabled for too long time or when a flash operation is
  *        performed. Stack will try to recover the situation, so there is
  *        normally no need to reset the device. However this condition should be
  *        avoided as much as possible. Error code 0x05 is raised when an error
  *        happens during a TX transaction. After this event is received with
  *        error code 0x00, 0x01, 0x02 or 0x03, it is recommended to force a
  *        device reset.
  *        Values:
  *        - 0x00: Generic HW error
  *        - 0x01: Radio state error
  *        - 0x02: Timer overrun error
  *        - 0x03: Internal queue overflow error
  *        - 0x04: Late Radio ISR
  *        - 0x05: TX Error
  * @retval None
  */

ble_status_t hci_hardware_error_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_hardware_error_event_rp0 *rp0 = (hci_hardware_error_event_rp0 *)buffer_in;
  hci_hardware_error_event(rp0->hardware_code);

  return status;
}
/* hci_number_of_completed_packets_event */
/* Event len: 1 + rp0->number_of_handles * (sizeof(packed_handle_packets_pair_entry_t)) */
/**
  * @brief The Number Of Completed Packets event is used by the Controller to
  *        indicate to the Host how many HCI Data Packets have been completed
  *        (transmitted or flushed) for each connection_handle since the previous
  *        Number Of Completed Packets event was sent to the Host. This means
  *        that the corresponding buffer space has been freed in the Controller.
  *        Based on this information, and the HC_Total_Num_ACL_Data_Packets and
  *        HC_Total_Num_Synchronous_- Data_Packets return parameter of the
  *        Read_Buffer_Size command, the Host can determine for which
  *        Connection_Handles the following HCI Data Packets should be sent to
  *        the Controller. The Number Of Completed Packets event must not be sent
  *        before the corresponding Connection Complete event. While the
  *        Controller has HCI data packets in its buffer, it must keep sending
  *        the Number Of Completed Packets event to the Host at least
  *        periodically, until it finally reports that all the pending ACL Data
  *        Packets have been transmitted or flushed.
  * @param number_of_handles The number of Connection_Handles and
  *        Num_HCI_Data_Packets parameters pairs contained in this event
  * @param handle_packets_pair_entry See @ref handle_packets_pair_entry_t
  * @retval None
  */

ble_status_t hci_number_of_completed_packets_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_number_of_completed_packets_event_rp0 *rp0 = (hci_number_of_completed_packets_event_rp0 *)buffer_in;
  uint8_t size = 1;
  uint32_t index;
  handle_packets_pair_entry_t handle_packets_pair_entry[HCI_MAX_PAYLOAD_SIZE / sizeof(handle_packets_pair_entry_t)];
  for (index = 0; index < rp0->number_of_handles; index++)
  {
    handle_packets_pair_entry[index].connection_handle = rp0->handle_packets_pair_entry[index].connection_handle;
    size += 2;
    handle_packets_pair_entry[index].hc_num_of_completed_packets =
      rp0->handle_packets_pair_entry[index].hc_num_of_completed_packets;
    size += 2;
  }
  hci_number_of_completed_packets_event(rp0->number_of_handles,
                                        handle_packets_pair_entry);

