zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
  return status;
}
/* hci_data_buffer_overflow_event */
/* Event len: 1 */
/**
  * @brief 'This event is used to indicate that the Controller's data buffers
  *        have been overflowed. This can occur if the Host has sent more packets
  *        than allowed. The link_type parameter is used to indicate that the
  *        overflow was caused by ACL data.
  * @param link_type On which type of channel overflow has occurred.
  *        Values:
  *        - 0x01: ACL Buffer Overflow
  * @retval None
  */

ble_status_t hci_data_buffer_overflow_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_data_buffer_overflow_event_rp0 *rp0 = (hci_data_buffer_overflow_event_rp0 *)buffer_in;
  hci_data_buffer_overflow_event(rp0->link_type);

  return status;
}
/* hci_encryption_key_refresh_complete_event */
/* Event len: 1 + 2 */
/**
  * @brief 'The Encryption Key Refresh Complete event is used to indicate to the
  *        Host that the encryption key was refreshed on the given
  *        connection_handle any time encryption is paused and then resumed. If
  *        the Encryption Key Refresh Complete event was generated due to an
  *        encryption pause and resume operation embedded within a change
  *        connection link key procedure, the Encryption Key Refresh Complete
  *        event shall be sent prior to the Change Connection Link Key Complete
  *        event. If the Encryption Key Refresh Complete event was generated due
  *        to an encryption pause and resume operation embedded within a role
  *        switch procedure, the Encryption Key Refresh Complete event shall be
  *        sent prior to the Role Change event.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval None
  */

ble_status_t hci_encryption_key_refresh_complete_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_encryption_key_refresh_complete_event_rp0 *rp0 = (hci_encryption_key_refresh_complete_event_rp0 *)buffer_in;
  hci_encryption_key_refresh_complete_event(rp0->status,
                                            rp0->connection_handle);

  return status;
}
/* hci_authenticated_payload_timeout_expired_event */
/* Event len: 2 */
/**
  * @brief The HCI_Authenticated_Payload_Timeout_Expired event is used to
  *        indicate that a packet containing a valid MIC on the connection_handle
  *        was not received within the authenticatedPayloadTO. Note: A Host may
  *        choose to disconnect the link when this occurs.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval None
  */

ble_status_t hci_authenticated_payload_timeout_expired_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_authenticated_payload_timeout_expired_event_rp0 *rp0 =
    (hci_authenticated_payload_timeout_expired_event_rp0 *)buffer_in;
  hci_authenticated_payload_timeout_expired_event(rp0->connection_handle);

  return status;
}
/* aci_blue_initialized_event */
/* Event len: 1 */
/**
  * @brief This event inform the application that the network coprocessor has
  *        been reset. If the reason code is a system crash, a following event
  *        @ref aci_blue_crash_info_event will provide more information regarding
  *        the system crash details.
  * @param reason_code reason code describing why device was reset and in which
  *        mode is operating (Updater or Normal mode)
  *        Values:
  *        - 0x01: Firmware started properly
  *        - 0x02: Updater mode entered with ACI command
  *        - 0x03: Updater mode entered due to bad Blue Flag
  *        - 0x04: Updater mode entered due to boot pin
  *        - 0x05: System reset due to watchdog
  *        - 0x06: System reset due to lockup
  *        - 0x07: System reset due to brownout reset
  *        - 0x08: System reset due to crash
  *        - 0x09: System reset due to ECC error
  * @retval None
  */

ble_status_t aci_blue_initialized_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_blue_initialized_event_rp0 *rp0 = (aci_blue_initialized_event_rp0 *)buffer_in;
  aci_blue_initialized_event(rp0->reason_code);

  return status;
}
/* aci_blue_events_lost_event */
/* Event len: 8 */
/**
  * @brief This event is generated when an overflow occurs in the event queue
  *        read by the external microcontroller. This is normally caused when the
  *        external microcontroller does  not read pending events. The returned
  *        bitmap indicates which event has been lost. Please  note that one bit
  *        set to 1 indicates one or more occurrences of the particular events.
  *        The event ACI_BLUE_EVENTS_LOST_EVENT cannot be lost and it will
  *        inserted in the event queue as soon as a position is freed in the
  *        event queue. This event should not happen under normal operating
  *        condition where external microcontroller promptly reads events
  *        signaled by IRQ pin. It is provided to detected unexpected behavior of
  *        the external microcontroller or to allow application to recover
  *        situations where critical events are lost.
  * @param lost_events Bitmap of lost events. Each bit indicates one or more
  *        occurrences of the specific event.
  *        Flags:
  *        - 0x0000000000000001: HCI_DISCONNECTION_COMPLETE_EVENT
  *        - 0x0000000000000002: HCI_ENCRYPTION_CHANGE_EVENT
  *        - 0x0000000000000004: HCI_READ_REMOTE_VERSION_INFORMATION_COMPLETE_EVENT
  *        - 0x0000000000000008: HCI_COMMAND_COMPLETE_EVENT
  *        - 0x0000000000000010: HCI_COMMAND_STATUS_EVENT
  *        - 0x0000000000000020: HCI_HARDWARE_ERROR_EVENT
  *        - 0x0000000000000040: HCI_NUMBER_OF_COMPLETED_PACKETS_EVENT
  *        - 0x0000000000000080: HCI_ENCRYPTION_KEY_REFRESH_COMPLETE_EVENT
  *        - 0x0000000000000100: ACI_BLUE_INITIALIZED_EVENT
  *        - 0x0000000000000200: ACI_GAP_LIMITED_DISCOVERABLE_EVENT
  *        - 0x0000000000000400: ACI_GAP_PAIRING_COMPLETE_EVENT
  *        - 0x0000000000000800: ACI_GAP_PASS_KEY_REQ_EVENT
  *        - 0x0000000000001000: ACI_GAP_AUTHORIZATION_REQ_EVENT
  *        - 0x0000000000002000: ACI_GAP_SLAVE_SECURITY_INITIATED_EVENT
  *        - 0x0000000000004000: ACI_GAP_BOND_LOST_EVENT
  *        - 0x0000000000008000: ACI_GAP_PROC_COMPLETE_EVENT
  *        - 0x0000000000010000: ACI_GAP_ADDR_NOT_RESOLVED_EVENT
  *        - 0x0000000000020000: ACI_L2CAP_CONNECTION_UPDATE_RESP_EVENT
  *        - 0x0000000000040000: ACI_L2CAP_PROC_TIMEOUT_EVENT
  *        - 0x0000000000080000: ACI_L2CAP_CONNECTION_UPDATE_REQ_EVENT
  *        - 0x0000000000100000: ACI_GATT_ATTRIBUTE_MODIFIED_EVENT
  *        - 0x0000000000200000: ACI_GATT_PROC_TIMEOUT_EVENT
  *        - 0x0000000000400000: ACI_ATT_EXCHANGE_MTU_RESP_EVENT
  *        - 0x0000000000800000: ACI_ATT_FIND_INFO_RESP_EVENT
  *        - 0x0000000001000000: ACI_ATT_FIND_BY_TYPE_VALUE_RESP_EVENT
  *        - 0x0000000002000000: ACI_ATT_READ_BY_TYPE_RESP_EVENT
  *        - 0x0000000004000000: ACI_ATT_READ_RESP_EVENT
  *        - 0x0000000008000000: ACI_ATT_READ_BLOB_RESP_EVENT
  *        - 0x0000000010000000: ACI_ATT_READ_MULTIPLE_RESP_EVENT
  *        - 0x0000000020000000: ACI_ATT_READ_BY_GROUP_TYPE_RESP_EVENT
  *        - 0x0000000040000000: ACI_ATT_WRITE_RESP_EVENT
  *        - 0x0000000080000000: ACI_ATT_PREPARE_WRITE_RESP_EVENT
  *        - 0x0000000100000000: ACI_ATT_EXEC_WRITE_RESP_EVENT
  *        - 0x0000000200000000: ACI_GATT_INDICATION_EVENT
  *        - 0x0000000400000000: ACI_GATT_NOTIFICATION_EVENT
  *        - 0x0000000800000000: ACI_GATT_PROC_COMPLETE_EVENT
  *        - 0x0000001000000000: ACI_GATT_ERROR_RESP_EVENT
  *        - 0x0000002000000000: ACI_GATT_DISC_READ_CHAR_BY_UUID_RESP_EVENT
  *        - 0x0000004000000000: ACI_GATT_WRITE_PERMIT_REQ_EVENT
  *        - 0x0000008000000000: ACI_GATT_READ_PERMIT_REQ_EVENT
  *        - 0x0000010000000000: ACI_GATT_READ_MULTI_PERMIT_REQ_EVENT
  *        - 0x0000020000000000: ACI_GATT_TX_POOL_AVAILABLE_EVENT
  *        - 0x0000040000000000: ACI_GATT_SERVER_CONFIRMATION_EVENT
  *        - 0x0000080000000000: ACI_GATT_PREPARE_WRITE_PERMIT_REQ_EVENT
  *        - 0x0000100000000000: HCI_LE_CONNECTION_COMPLETE_EVENT
  *        - 0x0000200000000000: HCI_LE_ADVERTISING_REPORT_EVENT
  *        - 0x0000400000000000: HCI_LE_CONNECTION_UPDATE_COMPLETE_EVENT
  *        - 0x0000800000000000: HCI_LE_READ_REMOTE_USED_FEATURES_COMPLETE_EVENT
  *        - 0x0001000000000000: HCI_LE_LONG_TERM_KEY_REQUEST_EVENT
  *        - 0x0002000000000000: HCI_LE_DATA_LENGTH_CHANGE_EVENT
  *        - 0x0004000000000000: HCI_LE_READ_LOCAL_P256_PUBLIC_KEY_COMPLETE_EVENT
  *        - 0x0008000000000000: HCI_LE_GENERATE_DHKEY_COMPLETE_EVENT
  *        - 0x0010000000000000: HCI_LE_ENHANCED_CONNECTION_COMPLETE_EVENT
  *        - 0x0020000000000000: HCI_LE_DIRECT_ADVERTISING_REPORT_EVENT
  *        - 0x0040000000000000: ACI_GAP_NUMERIC_COMPARISON_VALUE_EVENT
  *        - 0x0080000000000000: ACI_GAP_KEYPRESS_NOTIFICATION_EVENT
  * @retval None
  */

