zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
ble_status_t aci_blue_events_lost_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_blue_events_lost_event_rp0 *rp0 = (aci_blue_events_lost_event_rp0 *)buffer_in;
  aci_blue_events_lost_event(rp0->lost_events);

  return status;
}
/* aci_blue_crash_info_event */
/* Event len: 1 + 4 + 4 + 4 + 4 + 4 + 4 + 4 + 4 + 4 + 1 + rp0->debug_data_length * (sizeof(uint8_t)) */
/**
  * @brief This event is given to the application after the @ref
  *        aci_blue_initialized_event when a system crash is detected. This
  *        events returns system crash information for debugging purposes.
  *        Information reported are useful to understand the root cause of the
  *        crash.
  * @param crash_type Crash type
  *        Values:
  *        - 0x00: Assert failed
  *        - 0x01: NMI fault
  *        - 0x02: Hard fault
  * @param sp Stack pointer
  * @param r0 Register r0
  * @param r1 Register r1
  * @param r2 Register r2
  * @param r3 Register r3
  * @param r12 Register r12
  * @param lr Link register
  * @param pc Program counter where crash occurred
  * @param x_psr x_psr register
  * @param debug_data_length Length of debug_data field
  * @param debug_data Debug data
  * @retval None
  */

ble_status_t aci_blue_crash_info_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_blue_crash_info_event_rp0 *rp0 = (aci_blue_crash_info_event_rp0 *)buffer_in;
  aci_blue_crash_info_event(rp0->crash_type,
                            rp0->sp,
                            rp0->r0,
                            rp0->r1,
                            rp0->r2,
                            rp0->r3,
                            rp0->r12,
                            rp0->lr,
                            rp0->pc,
                            rp0->x_psr,
                            rp0->debug_data_length,
                            rp0->debug_data);

  return status;
}
/* aci_hal_end_of_radio_activity_event */
/* Event len: 1 + 1 + 4 */
/**
  * @brief This event is generated when the device completes a radio activity and
  *        provide information when a new radio activity will be performed.
  *        Information provided includes type of radio activity and absolute time
  *        in system ticks when a new radio activity is schedule, if any.
  *        Application can use this information to schedule user activities
  *        synchronous to selected radio activities. A command @ref
  *        aci_hal_set_radio_activity_mask is provided to enable radio activity
  *        events of user interests, by default no events are enabled. User
  *        should take into account that enabling radio events in application
  *        with intense radio activity could lead to a fairly high rate of events
  *        generated. Application use cases includes synchronizing notification
  *        with connection interval, switching  antenna at the end of advertising
  *        or performing flash erase operation while radio is idle.
  * @param last_state Completed radio events
  *        Values:
  *        - 0x00: Idle
  *        - 0x01: Advertising
  *        - 0x02: Connection event slave
  *        - 0x03: Scanning
  *        - 0x04: Connection request
  *        - 0x05: Connection event master
  *        - 0x06: TX test mode
  *        - 0x07: RX test mode
  * @param next_state Incoming radio events
  *        Values:
  *        - 0x00: Idle
  *        - 0x01: Advertising
  *        - 0x02: Connection event slave
  *        - 0x03: Scanning
  *        - 0x04: Connection request
  *        - 0x05: Connection event master
  *        - 0x06: TX test mode
  *        - 0x07: RX test mode
  * @param next_state_sys_time 32bit absolute current time expressed in internal
  *        time units.
  * @retval None
  */

ble_status_t aci_hal_end_of_radio_activity_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_hal_end_of_radio_activity_event_rp0 *rp0 = (aci_hal_end_of_radio_activity_event_rp0 *)buffer_in;
  aci_hal_end_of_radio_activity_event(rp0->last_state,
                                      rp0->next_state,
                                      rp0->next_state_sys_time);

  return status;
}
/* aci_hal_scan_req_report_event */
/* Event len: 1 + 1 + 6 */
/**
  * @brief This event is reported to the application after a scan request is
  *        received and a scan response is scheduled to be transmitted.
  * @param rssi N Size: 1 Octet (signed integer) Units: dBm
  *        Values:
  *        - 127: RSSI not available
  *        - -127 ... 20
  * @param peer_address_type 0x00 Public Device Address 0x01 Random Device
  *        Address 0x02 Public Identity Address (Corresponds to Resolved Private
  *        Address) 0x03 Random (Static) Identity Address (Corresponds to
  *        Resolved Private Address)
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  *        - 0x02: Public Identity Address
  *        - 0x03: Random (Static) Identity Address
  * @param peer_address Public Device Address or Random Device Address of the
  *        peer device
  * @retval None
  */

ble_status_t aci_hal_scan_req_report_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_hal_scan_req_report_event_rp0 *rp0 = (aci_hal_scan_req_report_event_rp0 *)buffer_in;
  aci_hal_scan_req_report_event(rp0->rssi,
                                rp0->peer_address_type,
                                rp0->peer_address);

  return status;
}
/* aci_hal_fw_error_event */
/* Event len: 1 + 1 + rp0->data_length * (sizeof(uint8_t)) */
/**
  * @brief This event is generated to report firmware error information.
  * @param fw_error_type Errore code identifying the type of error that has
  *        occurred.
  *        Values:
  *        - 0x01: HAL_FW_L2CAP_RECOMBINATION_ERROR
  *        - 0x02: HAL_FW_GATT_UNEXPECTED_RESPONSE_ERROR
  *        - 0x03: HAL_FW_GATT_SEQUENTIAL_PROTOCOL_ERROR
  *        - 0x04: HAL_FW_BONDING_DB_FULL_PAIRING_ERROR
  *        - 0x05: HAL_FW_BONDING_DB_FULL_GATTSERVICE_ERROR
  * @param data_length Length of Data in octets
  * @param data The error event info. If fw_error_type is 0x01, 0x02 or 0x03,
  *        this parameter contains the connection handle where the abnormal
  *        condition has occurred.
  * @retval None
  */

ble_status_t aci_hal_fw_error_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_hal_fw_error_event_rp0 *rp0 = (aci_hal_fw_error_event_rp0 *)buffer_in;
  aci_hal_fw_error_event(rp0->fw_error_type,
                         rp0->data_length,
                         rp0->data);

