zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
  return status;
}
/* aci_hal_le_test_end_event */
/* Event len: 2 */
/**
  * @brief This event is generated when the amount of transmitted test packets
  *        specified with aci_hal_transmitter_test_packets() has been reached.
  * @param number_of_packets The number of test packets actually transmitted.
  * @retval None
  */

ble_status_t aci_hal_le_test_end_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_hal_le_test_end_event_rp0 *rp0 = (aci_hal_le_test_end_event_rp0 *)buffer_in;
  aci_hal_le_test_end_event(rp0->number_of_packets);

  return status;
}
/* aci_gap_limited_discoverable_event */
/* Event len: 0 */
/**
  * @brief This event is generated by the controller when the limited
  *        discoverable mode ends due to timeout. The timeout is 180 seconds.
  * @retval None
  */

ble_status_t aci_gap_limited_discoverable_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  aci_gap_limited_discoverable_event();

  return status;
}
/* aci_gap_pairing_complete_event */
/* Event len: 2 + 1 + 1 */
/**
  * @brief This event is generated when the pairing process has completed
  *        successfully or a pairing procedure timeout has occurred or the
  *        pairing has failed. This is to notify the application that we have
  *        paired with a remote device so that it can take further actions or to
  *        notify that a timeout has occurred so that the upper layer can decide
  *        to disconnect the link.
  * @param connection_handle Connection handle on which the pairing procedure
  *        completed
  * @param status Pairing status. If 0x02, see reason code.
  *        Values:
  *        - 0x00: Success
  *        - 0x01: Timeout
  *        - 0x02: Pairing Failed
  *        - 0x03: Encryption failed, LTK missing on local device
  *        - 0x04: Encryption failed, LTK missing on peer device
  *        - 0x05: Encryption not supported by remote device
  * @param reason Pairing reason error code
  *        Values:
  *        - 0x00
  *        - 0x01: PASSKEY_ENTRY_FAILED
  *        - 0x02: OOB_NOT_AVAILABLE
  *        - 0x03: AUTH_REQ_CANNOT_BE_MET
  *        - 0x04: CONFIRM_VALUE_FAILED
  *        - 0x05: PAIRING_NOT_SUPPORTED
  *        - 0x06: INSUFF_ENCRYPTION_KEY_SIZE
  *        - 0x07: CMD_NOT_SUPPORTED
  *        - 0x08: UNSPECIFIED_REASON
  *        - 0x09: VERY_EARLY_NEXT_ATTEMPT
  *        - 0x0A: SM_INVALID_PARAMS
  *        - 0x0B: SMP_SC_DHKEY_CHECK_FAILED
  *        - 0x0C: SMP_SC_NUMCOMPARISON_FAILED
  * @retval None
  */

ble_status_t aci_gap_pairing_complete_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gap_pairing_complete_event_rp0 *rp0 = (aci_gap_pairing_complete_event_rp0 *)buffer_in;
  aci_gap_pairing_complete_event(rp0->connection_handle,
                                 rp0->status,
                                 rp0->reason);

  return status;
}
/* aci_gap_pass_key_req_event */
/* Event len: 2 */
/**
  * @brief This event is generated by the Security manager to the application
  *        when a passkey is required for pairing. When this event is received,
  *        the application has to respond with the @ref aci_gap_pass_key_resp
  *        command.
  * @param connection_handle Connection handle for which the passkey has been
  *        requested.
  * @retval None
  */

ble_status_t aci_gap_pass_key_req_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gap_pass_key_req_event_rp0 *rp0 = (aci_gap_pass_key_req_event_rp0 *)buffer_in;
  aci_gap_pass_key_req_event(rp0->connection_handle);

  return status;
}
/* aci_gap_slave_security_initiated_event */
/* Event len: 0 */
/**
  * @brief This event is generated when the slave security request is
  *        successfully sent to the master.
  * @retval None
  */

ble_status_t aci_gap_slave_security_initiated_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  aci_gap_slave_security_initiated_event();

  return status;
}
/* aci_gap_bond_lost_event */
/* Event len: 0 */
/**
  * @brief This event is generated on the slave when a
  *        ACI_GAP_SLAVE_SECURITY_REQUEST is called to reestablish the bond with
  *        a master but the master has lost the bond. When this event is
  *        received, the upper layer has to issue the ACI_GAP_ALLOW_REBOND
  *        command in order to allow the slave to continue the pairing process
  *        with the master. On the master this event is raised when
  *        ACI_GAP_SEND_PAIRING_REQUEST is called to reestablish a bond with a
  *        slave but the slave has lost the bond. In order to create a new bond
  *        the master has to launch ACI_GAP_SEND_PAIRING_REQUEST with
  *        force_rebond set to 1.
  * @retval None
  */

ble_status_t aci_gap_bond_lost_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  aci_gap_bond_lost_event();

  return status;
}
/* aci_gap_proc_complete_event */
/* Event len: 1 + 1 + 1 + rp0->data_length * (sizeof(uint8_t)) */
/**
  * @brief This event is sent by the GAP to the upper layers when a procedure
  *        previously started has been terminated by the upper layer or has
  *        completed for any other reason
  * @param procedure_code Code identifying the procedure.
  *        Values:
  *        - 0x00: GAP_LIMITED_DISCOVERY_PROC
  *        - 0x01: GAP_GENERAL_DISCOVERY_PROC
  *        - 0x02: GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x03: GAP_GENERAL_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x04: GAP_SELECTIVE_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x05: GAP_OBSERVATION_PROC
  *        - 0x06: GAP_DIRECT_CONNECTION_ESTABLISHMENT_PROC
  *        - 0x07: GAP_NAME_DISCOVERY_PROC
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param data_length Length of Data in octets
  * @param data Procedure Specific Data: - For Name Discovery Procedure: the name
  *        of the peer device if the procedure completed successfully.
  * @retval None
  */

