zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
ble_status_t aci_gap_proc_complete_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gap_proc_complete_event_rp0 *rp0 = (aci_gap_proc_complete_event_rp0 *)buffer_in;
  aci_gap_proc_complete_event(rp0->procedure_code,
                              rp0->status,
                              rp0->data_length,
                              rp0->data);

  return status;
}
/* aci_gap_addr_not_resolved_event */
/* Event len: 2 */
/**
  * @brief This event is sent only by a privacy enabled Peripheral. The event is
  *        sent to the upper layers when the peripheral is unsuccessful in
  *        resolving the resolvable address of the peer device after connecting
  *        to it.
  * @param connection_handle Connection handle for which the private address
  *        could not be resolved with any of the stored IRK's.
  * @retval None
  */

ble_status_t aci_gap_addr_not_resolved_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gap_addr_not_resolved_event_rp0 *rp0 = (aci_gap_addr_not_resolved_event_rp0 *)buffer_in;
  aci_gap_addr_not_resolved_event(rp0->connection_handle);

  return status;
}
/* aci_gap_numeric_comparison_value_event */
/* Event len: 2 + 4 */
/**
  * @brief This event is sent only during SC v.4.2 Pairing, when Numeric
  *        Comparison Association model is selected, in order to show the Numeric
  *        Value generated, and to ask for Confirmation to the User. When this
  *        event is received, the application has to respond with the  @ref
  *        aci_gap_numeric_comparison_value_confirm_yesno command
  * @param connection_handle Connection handle related to the underlying Pairing
  * @param numeric_value
  * @retval None
  */

ble_status_t aci_gap_numeric_comparison_value_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gap_numeric_comparison_value_event_rp0 *rp0 = (aci_gap_numeric_comparison_value_event_rp0 *)buffer_in;
  aci_gap_numeric_comparison_value_event(rp0->connection_handle,
                                         rp0->numeric_value);

  return status;
}
/* aci_gap_keypress_notification_event */
/* Event len: 2 + 1 */
/**
  * @brief This event is sent only during SC v.4.2 Pairing, when Keypress
  *        Notifications are supported, in order to show the input type signalled
  *        by the peer device, having Keyboard only I/O capabilities. When this
  *        event is received, no action is required to the User.
  * @param connection_handle Connection handle related to the underlying Pairing
  * @param notification_type Type of Keypress input notified/signaled by peer
  *        device
  *        Values:
  *        - 0x00: PASSKEY_ENTRY_STARTED
  *        - 0x01: PASSKEY_DIGIT_ENTERED
  *        - 0x02: PASSKEY_DIGIT_ERASED
  *        - 0x03: PASSKEY_CLEARED
  *        - 0x04: PASSKEY_ENTRY_COMPLETED
  * @retval None
  */

ble_status_t aci_gap_keypress_notification_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gap_keypress_notification_event_rp0 *rp0 = (aci_gap_keypress_notification_event_rp0 *)buffer_in;
  aci_gap_keypress_notification_event(rp0->connection_handle,
                                      rp0->notification_type);

  return status;
}
/* aci_l2cap_connection_update_resp_event */
/* Event len: 2 + 2 */
/**
  * @brief This event is generated when the master responds to the connection
  *        update request packet with a connection update response packet.
  * @param connection_handle Connection handle referring to the COS Channel where
  *        the Disconnection has been received.
  * @param result
  * @retval None
  */

ble_status_t aci_l2cap_connection_update_resp_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_l2cap_connection_update_resp_event_rp0 *rp0 = (aci_l2cap_connection_update_resp_event_rp0 *)buffer_in;
  aci_l2cap_connection_update_resp_event(rp0->connection_handle,
                                         rp0->result);

  return status;
}
/* aci_l2cap_proc_timeout_event */
/* Event len: 2 + 1 + rp0->data_length * (sizeof(uint8_t)) */
/**
  * @brief This event is generated when the master does not respond to the
  *        connection update request packet with a connection update response
  *        packet or a command reject packet within 30 seconds.
  * @param connection_handle Handle of the connection related to this L2CAP
  *        procedure.
  * @param data_length Length of following data
  * @param data
  * @retval None
  */

ble_status_t aci_l2cap_proc_timeout_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_l2cap_proc_timeout_event_rp0 *rp0 = (aci_l2cap_proc_timeout_event_rp0 *)buffer_in;
  aci_l2cap_proc_timeout_event(rp0->connection_handle,
                               rp0->data_length,
                               rp0->data);

  return status;
}
/* aci_l2cap_connection_update_req_event */
/* Event len: 2 + 1 + 2 + 2 + 2 + 2 + 2 */
/**
  * @brief The event is given by the L2CAP layer when a connection update request
  *        is received from the slave. The upper layer which receives this event
  *        has to respond by sending a @ref
  *        aci_l2cap_connection_parameter_update_resp command.
  * @param connection_handle Handle of the connection related to this L2CAP
  *        procedure.
  * @param identifier This is the identifier which associates the request to the
  *        response.
  * @param l2_cap_length Length of the L2CAP connection update request.
  * @param interval_min Minimum value for the connection event interval. This
  *        shall be less than or equal to conn_interval_max. Time = N * 1.25
  *        msec.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param interval_max Maximum value for the connection event interval. This
  *        shall be greater than or equal to conn_interval_min. Time = N * 1.25
  *        msec.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param slave_latency Slave latency for the connection in number of connection
  *        events.
  *        Values:
  *        - 0x0000 ... 0x01F3
  * @param timeout_multiplier Defines connection timeout parameter in the
  *        following manner: Timeout Multiplier * 10ms.
  *        Values:
  *        - 10 (100 ms)  ... 3200 (32000 ms)
  * @retval None
  */

ble_status_t aci_l2cap_connection_update_req_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_l2cap_connection_update_req_event_rp0 *rp0 = (aci_l2cap_connection_update_req_event_rp0 *)buffer_in;
  aci_l2cap_connection_update_req_event(rp0->connection_handle,
                                        rp0->identifier,
                                        rp0->l2_cap_length,
                                        rp0->interval_min,
                                        rp0->interval_max,
                                        rp0->slave_latency,
                                        rp0->timeout_multiplier);

