zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
  return status;
}
/* aci_l2cap_cfc_connection_event */
/* Event len: 2 + 1 + 2 + 1 + 2 + 2 + 2 + 2 + 2 + 2 */
/**
  * @brief Event generated when a request or a response is received from the peer
  *        to create an L2CAP channel.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param event_type
  *        Values:
  *        - 0x00: L2CAP_CONN_REQ
  *        - 0x01: L2CAP_CONN_RESP
  * @param result Result of the connection request if event_type is
  *        L2CAP_CONN_RESP. To be ignored if event_type is L2CAP_CONN_REQ.
  *        Values:
  *        - 0x0000: L2CAP_CONN_SUCCESSFUL
  *        - 0x0002: L2CAP_SPSM_NOT_SUPPORTED
  *        - 0x0004: L2CAP_NO_RESOURCE_AVAILABLE
  *        - 0x0005: L2CAP_INSUFFICIENT_AUTHENTICATION
  *        - 0x0006: L2CAP_INSUFFICIENT_AUTHORIZATION
  *        - 0x0007: L2CAP_INSUFFICIENT_ENCRYPTION_KEY_SIZE
  *        - 0x0008: L2CAP_INSUFFICIENT_ENCRYPTION
  *        - 0x0009: L2CAP_INVALID_SOURCE_CID
  *        - 0x000A: L2CAP_SOURCE_CID_ALREADY_ALLOCATED
  *        - 0x000B: L2CAP_UNACCEPTABLE_PARAMETERS
  * @param identifier This is the identifier which associates the request to the
  *        response.
  * @param spsm Simplified Protocol/Service Multiplexer
  *        Values:
  *        - 0x0001 ... 0x00FF
  * @param cid The local channel endpoint that identifies the L2CAP channel. To
  *        be ignored if event_type is L2CAP_CONN_REQ.
  * @param remote_cid The channel endpoint on the remote device.
  * @param peer_mtu The maximum SDU size (in octets) that the L2CAP layer entity
  *        sending the L2CAP_LE_CREDIT_BASED_CONNECTION_REQ can receive on this
  *        channel.
  *        Values:
  *        - 23 ... 65535
  * @param peer_mps The maximum PDU payload size (in octets) that the L2CAP layer
  *        entity sending the L2CAP_LE_CREDIT_BASED_CONNECTION_REQ is capable of
  *        receiving on this channel.
  *        Values:
  *        - 23 ... 65535
  * @param initial_credits The number of K-frames that the peer device can send
  *        to the L2CAP layer entity as soon as the L2CAP channel is established.
  * @retval None
  */

ble_status_t aci_l2cap_cfc_connection_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_l2cap_cfc_connection_event_rp0 *rp0 = (aci_l2cap_cfc_connection_event_rp0 *)buffer_in;
  aci_l2cap_cfc_connection_event(rp0->connection_handle,
                                 rp0->event_type,
                                 rp0->result,
                                 rp0->identifier,
                                 rp0->spsm,
                                 rp0->cid,
                                 rp0->remote_cid,
                                 rp0->peer_mtu,
                                 rp0->peer_mps,
                                 rp0->initial_credits);

  return status;
}
/* aci_l2cap_disconnection_complete_event */
/* Event len: 2 + 2 */
/**
  * @brief Event raised when an L2CAP channel using LE Credit Based Flow Control
  *        mode is terminated.
  * @param connection_handle Handle identifying the connection.
  * @param cid The local channel endpoint that identifies the L2CAP channel.
  * @retval None
  */

ble_status_t aci_l2cap_disconnection_complete_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_l2cap_disconnection_complete_event_rp0 *rp0 = (aci_l2cap_disconnection_complete_event_rp0 *)buffer_in;
  aci_l2cap_disconnection_complete_event(rp0->connection_handle,
                                         rp0->cid);

  return status;
}
/* aci_l2cap_flow_control_credit_event */
/* Event len: 2 + 2 + 2 + 2 */
/**
  * @brief Events raised when an L2CAP_FLOW_CONTROL_CREDIT_IND is received from
  *        the peer, which means that it is capable of receiving additional
  *        K-frames (for example after it has processed one or more K-frames) in
  *        LE Credit Based Flow Control.
  * @param connection_handle Handle identifying the connection.
  * @param cid The local channel endpoint that identifies the L2CAP channel.
  * @param tx_credits The number of additional k-frames that the peer's L2CAP
  *        layer entity can receive.
  * @param tx_credit_balance Remaining number of K-frames that local L2CAP layer
  *        entity can currently send to the peer.
  *        Values:
  *        - 1 ... 65535
  * @retval None
  */

ble_status_t aci_l2cap_flow_control_credit_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_l2cap_flow_control_credit_event_rp0 *rp0 = (aci_l2cap_flow_control_credit_event_rp0 *)buffer_in;
  aci_l2cap_flow_control_credit_event(rp0->connection_handle,
                                      rp0->cid,
                                      rp0->tx_credits,
                                      rp0->tx_credit_balance);

  return status;
}
/* aci_l2cap_sdu_data_tx_nwk_event */
/* Event len: 2 + 2 + 2 + 2 */
/**
  * @brief Event raised when an SDU to be transmitted has been processed by the
  *        local L2CAP layer entity.
  * @param connection_handle Handle identifying the connection.
  * @param cid The local channel endpoint that identifies the L2CAP channel.
  * @param sdu_length
  * @param tx_credit_balance Remaining number of K-frames that local L2CAP layer
  *        entity can currently send to the peer.
  * @retval None
  */

ble_status_t aci_l2cap_sdu_data_tx_nwk_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_l2cap_sdu_data_tx_nwk_event_rp0 *rp0 = (aci_l2cap_sdu_data_tx_nwk_event_rp0 *)buffer_in;
  aci_l2cap_sdu_data_tx_nwk_event(rp0->connection_handle,
                                  rp0->cid,
                                  rp0->sdu_length,
                                  rp0->tx_credit_balance);

  return status;
}
/* aci_l2cap_sdu_data_rx_nwk_event */
/* Event len: 2 + 2 + 2 + 2 + rp0->sdu_length * (sizeof(uint8_t)) */
/**
  * @brief Event raised when an SDU has been received.
  * @param connection_handle Handle identifying the connection.
  * @param cid The local channel endpoint that identifies the L2CAP channel.
  * @param rx_credit_balance Remaining number of K-frames that local L2CAP layer
  *        entity can currently receive from the peer. If automatic management of
  *        credits is enabled, this number is automatically changed after the SDU
  *        is extracted.
  * @param sdu_length
  * @param sdu_data
  * @retval None
  */

ble_status_t aci_l2cap_sdu_data_rx_nwk_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_l2cap_sdu_data_rx_nwk_event_rp0 *rp0 = (aci_l2cap_sdu_data_rx_nwk_event_rp0 *)buffer_in;
  aci_l2cap_sdu_data_rx_nwk_event(rp0->connection_handle,
                                  rp0->cid,
                                  rp0->rx_credit_balance,
                                  rp0->sdu_length,
                                  rp0->sdu_data);

