zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
  return status;
}
/* aci_l2cap_command_reject_event */
/* Event len: 2 + 1 + 2 + 1 + rp0->data_length * (sizeof(uint8_t)) */
/**
  * @brief This event is generated when the master rejects a L2CAP request.
  * @param connection_handle Handle identifying the connection.
  * @param identifier This is the identifier which associates the request to the
  *        response.
  * @param reason reason
  * @param data_length Length of following data
  * @param data Data field associated with reason
  * @retval None
  */

ble_status_t aci_l2cap_command_reject_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_l2cap_command_reject_event_rp0 *rp0 = (aci_l2cap_command_reject_event_rp0 *)buffer_in;
  aci_l2cap_command_reject_event(rp0->connection_handle,
                                 rp0->identifier,
                                 rp0->reason,
                                 rp0->data_length,
                                 rp0->data);

  return status;
}
/* aci_gatt_srv_attribute_modified_event */
/* Event len: 2 + 2 + 2 + rp0->attr_data_length * (sizeof(uint8_t)) */
/**
  * @brief This event is generated to the application by the GATT server when a
  *        client modifies any attribute on the server, as consequence of one of
  *        the following GATT procedures: - write without response - signed write
  *        without response - write characteristic value - write long
  *        characteristic value - reliable write.
  * @param connection_handle The connection handle which modified the attribute.
  * @param attr_handle Handle of the attribute that was modified.
  * @param attr_data_length Length of attr_data in octets
  * @param attr_data The modified value
  * @retval None
  */

ble_status_t aci_gatt_srv_attribute_modified_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gatt_srv_attribute_modified_event_rp0 *rp0 = (aci_gatt_srv_attribute_modified_event_rp0 *)buffer_in;
  aci_gatt_srv_attribute_modified_event(rp0->connection_handle,
                                        rp0->attr_handle,
                                        rp0->attr_data_length,
                                        rp0->attr_data);

  return status;
}
/* aci_gatt_proc_timeout_event */
/* Event len: 2 */
/**
  * @brief This event is generated by the client/server to the application on a
  *        GATT timeout (30 seconds). This is a critical event that should not
  *        happen during normal operating conditions. It is an indication of
  *        either a major disruption in the communication link or a mistake in
  *        the application which does not provide a reply to GATT procedures.
  *        After this event, the GATT channel is closed and no more GATT
  *        communication can be performed. The applications is expected to issue
  *        an @ref aci_gap_terminate to disconnect from the peer device. It is
  *        important to leave an 100 ms blank window before sending the @ref
  *        aci_gap_terminate, since immediately after this event, system could
  *        save important information in non volatile memory.
  * @param connection_handle Connection handle on which the GATT procedure has
  *        timed out
  * @retval None
  */

ble_status_t aci_gatt_proc_timeout_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gatt_proc_timeout_event_rp0 *rp0 = (aci_gatt_proc_timeout_event_rp0 *)buffer_in;
  aci_gatt_proc_timeout_event(rp0->connection_handle);

  return status;
}
/* aci_att_exchange_mtu_resp_event */
/* Event len: 2 + 2 */
/**
  * @brief This event is generated in response to an Exchange MTU request (local
  *        or from the peer). See aci_gatt_clt_exchange_config().
  * @param connection_handle Connection handle related to the response
  * @param server_rx_mtu ATT_MTU value agreed between server and client
  * @retval None
  */

ble_status_t aci_att_exchange_mtu_resp_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_att_exchange_mtu_resp_event_rp0 *rp0 = (aci_att_exchange_mtu_resp_event_rp0 *)buffer_in;
  aci_att_exchange_mtu_resp_event(rp0->connection_handle,
                                  rp0->server_rx_mtu);

  return status;
}
/* aci_att_clt_find_info_resp_event */
/* Event len: 2 + 1 + 2 + rp0->event_data_length * (sizeof(uint8_t)) */
/**
  * @brief This event is generated in response to a Find Information Request
  *        during a discovery procedure for all the characteristic descriptors.
  *        See aci_gatt_clt_disc_all_char_desc() and Find Information Response in
  *        Bluetooth Core spec.
  * @param connection_handle Connection handle related to the response
  * @param format Format of the hanndle-uuid pairs
  * @param event_data_length Length of handle_uuid_pair in octets
  * @param handle_uuid_pair A sequence of handle-uuid pairs. if format=1, each
  *        pair is:[2 octets for handle, 2 octets for UUIDs], if format=2, each
  *        pair is:[2 octets for handle, 16 octets for UUIDs]
  * @retval None
  */

ble_status_t aci_att_clt_find_info_resp_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_att_clt_find_info_resp_event_rp0 *rp0 = (aci_att_clt_find_info_resp_event_rp0 *)buffer_in;
  aci_att_clt_find_info_resp_event(rp0->connection_handle,
                                   rp0->format,
                                   rp0->event_data_length,
                                   rp0->handle_uuid_pair);

  return status;
}
/* aci_att_clt_find_by_type_value_resp_event */
/* Event len: 2 + 1 + rp0->num_of_handle_pair * (sizeof(packed_attribute_group_handle_pair_t)) */
/**
  * @brief This event is generated during a "discover service by UUID" procedure.
  *        See aci_gatt_clt_disc_primary_service_by_uuid().
  * @param connection_handle Connection handle related to the response
  * @param num_of_handle_pair Number of attribute, group handle pairs
  * @param attr_group_handle_pair See @ref attribute_group_handle_pair_t
  * @retval None
  */

ble_status_t aci_att_clt_find_by_type_value_resp_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_att_clt_find_by_type_value_resp_event_rp0 *rp0 = (aci_att_clt_find_by_type_value_resp_event_rp0 *)buffer_in;
  uint8_t size = 3;
  uint32_t index;
  attribute_group_handle_pair_t attr_group_handle_pair[HCI_MAX_PAYLOAD_SIZE /
                                                       sizeof(attribute_group_handle_pair_t)];
  for (index = 0; index < rp0->num_of_handle_pair; index++)
  {
    attr_group_handle_pair[index].found_attribute_handle =
      rp0->attr_group_handle_pair[index].found_attribute_handle;
    size += 2;
    attr_group_handle_pair[index].group_end_handle = rp0->attr_group_handle_pair[index].group_end_handle;
    size += 2;
  }
  aci_att_clt_find_by_type_value_resp_event(rp0->connection_handle,
                                            rp0->num_of_handle_pair,
                                            attr_group_handle_pair);

