zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
  return status;
}
/* aci_att_clt_read_by_type_resp_event */
/* Event len: 2 + 1 + 2 + rp0->data_length * (sizeof(uint8_t)) */
/**
  * @brief This event is generated in response to a ATT_READ_BY_TYPE_REQ, during
  *        a "find included service" procedure or a "discover all
  *        characteristics" procedure. See aci_gatt_clt_find_included_services()
  *        and aci_gatt_clt_disc_all_char_of_service().
  * @param connection_handle Connection handle related to the response
  * @param handle_value_pair_length The size of each attribute handle-value pair
  * @param data_length Length of handle_value_pair_data in octets
  * @param handle_value_pair_data Attribute Data List as defined in Bluetooth
  *        Core v4.1 spec. A sequence of handle-value pairs: [2 octets for
  *        Attribute Handle, (handle_value_pair_length - 2 octets) for Attribute
  *        Value]
  * @retval None
  */

ble_status_t aci_att_clt_read_by_type_resp_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_att_clt_read_by_type_resp_event_rp0 *rp0 = (aci_att_clt_read_by_type_resp_event_rp0 *)buffer_in;
  aci_att_clt_read_by_type_resp_event(rp0->connection_handle,
                                      rp0->handle_value_pair_length,
                                      rp0->data_length,
                                      rp0->handle_value_pair_data);

  return status;
}
/* aci_att_clt_read_resp_event */
/* Event len: 2 + 2 + rp0->event_data_length * (sizeof(uint8_t)) */
/**
  * @brief This event is generated in response to a Read Request. See
  *        aci_gatt_clt_read().
  * @param connection_handle Connection handle related to the response
  * @param event_data_length Length of following data
  * @param attribute_value The value of the attribute.
  * @retval None
  */

ble_status_t aci_att_clt_read_resp_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_att_clt_read_resp_event_rp0 *rp0 = (aci_att_clt_read_resp_event_rp0 *)buffer_in;
  aci_att_clt_read_resp_event(rp0->connection_handle,
                              rp0->event_data_length,
                              rp0->attribute_value);

  return status;
}
/* aci_att_clt_read_blob_resp_event */
/* Event len: 2 + 2 + rp0->event_data_length * (sizeof(uint8_t)) */
/**
  * @brief This event can be generated during a read long characteristic value
  *        procedure. See aci_gatt_clt_read_long().
  * @param connection_handle Connection handle related to the response
  * @param event_data_length Length of following data
  * @param attribute_value Part of the attribute value.
  * @retval None
  */

ble_status_t aci_att_clt_read_blob_resp_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_att_clt_read_blob_resp_event_rp0 *rp0 = (aci_att_clt_read_blob_resp_event_rp0 *)buffer_in;
  aci_att_clt_read_blob_resp_event(rp0->connection_handle,
                                   rp0->event_data_length,
                                   rp0->attribute_value);

  return status;
}
/* aci_att_clt_read_multiple_resp_event */
/* Event len: 2 + 2 + rp0->event_data_length * (sizeof(uint8_t)) */
/**
  * @brief This event is generated in response to a Read Multiple Request. See
  *        aci_gatt_clt_read_multiple_char_value().
  * @param connection_handle Connection handle related to the response
  * @param event_data_length Length of following data
  * @param set_of_values A set of two or more values. A concatenation of
  *        attribute values for each of the attribute handles in the request in
  *        the order that they were requested.
  * @retval None
  */

ble_status_t aci_att_clt_read_multiple_resp_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_att_clt_read_multiple_resp_event_rp0 *rp0 = (aci_att_clt_read_multiple_resp_event_rp0 *)buffer_in;
  aci_att_clt_read_multiple_resp_event(rp0->connection_handle,
                                       rp0->event_data_length,
                                       rp0->set_of_values);

  return status;
}
/* aci_att_clt_read_by_group_type_resp_event */
/* Event len: 2 + 1 + 2 + rp0->data_length * (sizeof(uint8_t)) */
/**
  * @brief This event is generated in response to a Read By Group Type Request,
  *        during a "discover all primary services" procedure. See
  *        aci_gatt_clt_disc_all_primary_services().
  * @param connection_handle Connection handle related to the response
  * @param Attribute_Data_Length The size of each attribute data
  * @param data_length Length of attribute_data_list in octets
  * @param attribute_data_list Attribute Data List as defined in Bluetooth Core
  *        v4.1 spec. A sequence of attribute handle, end group handle, attribute
  *        value tuples: [2 octets for Attribute Handle, 2 octets End Group
  *        Handle, (Attribute_Data_Length - 4 octets) for Attribute Value]
  * @retval None
  */

ble_status_t aci_att_clt_read_by_group_type_resp_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_att_clt_read_by_group_type_resp_event_rp0 *rp0 = (aci_att_clt_read_by_group_type_resp_event_rp0 *)buffer_in;
  aci_att_clt_read_by_group_type_resp_event(rp0->connection_handle,
                                            rp0->Attribute_Data_Length,
                                            rp0->data_length,
                                            rp0->attribute_data_list);

  return status;
}
/* aci_att_clt_prepare_write_resp_event */
/* Event len: 2 + 2 + 2 + 2 + rp0->part_attribute_value_length * (sizeof(uint8_t)) */
/**
  * @brief This event is generated in response to an ATT_PREPARE_WRITE_REQ during
  *        a write long characteristic value procedure. See
  *        aci_gatt_clt_write_long().
  * @param connection_handle Connection handle related to the response
  * @param attribute_handle The handle of the attribute to be written
  * @param offset The offset of the first octet to be written.
  * @param part_attribute_value_length Length of part_attribute_value in octets
  * @param part_attribute_value The value of the attribute to be written
  * @retval None
  */

ble_status_t aci_att_clt_prepare_write_resp_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_att_clt_prepare_write_resp_event_rp0 *rp0 = (aci_att_clt_prepare_write_resp_event_rp0 *)buffer_in;
  aci_att_clt_prepare_write_resp_event(rp0->connection_handle,
                                       rp0->attribute_handle,
                                       rp0->offset,
                                       rp0->part_attribute_value_length,
                                       rp0->part_attribute_value);

