zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
  return status;
}
/* aci_att_clt_exec_write_resp_event */
/* Event len: 2 */
/**
  * @brief This event is generated in response to an ATT Execute Write Request,
  *        during a write long characteristic value procedure. See
  *        aci_gatt_clt_write_long().
  * @param connection_handle Connection handle related to the response
  * @retval None
  */

ble_status_t aci_att_clt_exec_write_resp_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_att_clt_exec_write_resp_event_rp0 *rp0 = (aci_att_clt_exec_write_resp_event_rp0 *)buffer_in;
  aci_att_clt_exec_write_resp_event(rp0->connection_handle);

  return status;
}
/* aci_gatt_clt_indication_event */
/* Event len: 2 + 2 + 2 + rp0->attribute_value_length * (sizeof(uint8_t)) */
/**
  * @brief This event is generated when an indication is received from the
  *        server.
  * @param connection_handle Connection handle related to the response
  * @param attribute_handle The handle of the attribute
  * @param attribute_value_length Length of attribute_value in octets
  * @param attribute_value The current value of the attribute
  * @retval None
  */

ble_status_t aci_gatt_clt_indication_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gatt_clt_indication_event_rp0 *rp0 = (aci_gatt_clt_indication_event_rp0 *)buffer_in;
  aci_gatt_clt_indication_event(rp0->connection_handle,
                                rp0->attribute_handle,
                                rp0->attribute_value_length,
                                rp0->attribute_value);

  return status;
}
/* aci_gatt_clt_notification_event */
/* Event len: 2 + 2 + 2 + rp0->attribute_value_length * (sizeof(uint8_t)) */
/**
  * @brief This event is generated when a notification is received from the
  *        server.
  * @param connection_handle Connection handle related to the response
  * @param attribute_handle The handle of the attribute
  * @param attribute_value_length Length of attribute_value in octets
  * @param attribute_value The current value of the attribute
  * @retval None
  */

ble_status_t aci_gatt_clt_notification_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gatt_clt_notification_event_rp0 *rp0 = (aci_gatt_clt_notification_event_rp0 *)buffer_in;
  aci_gatt_clt_notification_event(rp0->connection_handle,
                                  rp0->attribute_handle,
                                  rp0->attribute_value_length,
                                  rp0->attribute_value);

  return status;
}
/* aci_gatt_clt_proc_complete_event */
/* Event len: 2 + 1 */
/**
  * @brief This event is generated when a GATT client procedure completes either
  *        with error or successfully.
  * @param connection_handle Connection handle related to the response
  * @param error_code For standard error codes see Bluetooth specification, Vol.
  *        2, part D. For proprietary error code refer to Error codes section.
  * @retval None
  */

ble_status_t aci_gatt_clt_proc_complete_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gatt_clt_proc_complete_event_rp0 *rp0 = (aci_gatt_clt_proc_complete_event_rp0 *)buffer_in;
  aci_gatt_clt_proc_complete_event(rp0->connection_handle,
                                   rp0->error_code);

  return status;
}
/* aci_gatt_clt_error_resp_event */
/* Event len: 2 + 1 + 2 + 1 */
/**
  * @brief This event is generated when an Error Response is received from the
  *        server. The error response can be given by the server at the end of
  *        one of the GATT discovery procedures. This does not mean that the
  *        procedure ended with an error, but this error event is part of the
  *        procedure itself.
  * @param connection_handle Connection handle related to the response
  * @param req_op_code The request that generated this error response
  * @param attribute_handle The attribute handle that generated this error
  *        response
  * @param error_code The reason why the request has generated an error response
  *        (ATT error codes)
  *        Values:
  *        - 0x01: Invalid handle
  *        - 0x02: Read not permitted
  *        - 0x03: Write not permitted
  *        - 0x04: Invalid PDU
  *        - 0x05: Insufficient authentication
  *        - 0x06: Request not supported
  *        - 0x07: Invalid offset
  *        - 0x08: Insufficient authorization
  *        - 0x09: Prepare queue full
  *        - 0x0A: Attribute not found
  *        - 0x0B: Attribute not long
  *        - 0x0C: Insufficient encryption key size
  *        - 0x0D: Invalid attribute value length
  *        - 0x0E: Unlikely error
  *        - 0x0F: Insufficient encryption
  *        - 0x10: Unsupported group type
  *        - 0x11: Insufficient resources
  * @retval None
  */

ble_status_t aci_gatt_clt_error_resp_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gatt_clt_error_resp_event_rp0 *rp0 = (aci_gatt_clt_error_resp_event_rp0 *)buffer_in;
  aci_gatt_clt_error_resp_event(rp0->connection_handle,
                                rp0->req_op_code,
                                rp0->attribute_handle,
                                rp0->error_code);

  return status;
}
/* aci_gatt_clt_disc_read_char_by_uuid_resp_event */
/* Event len: 2 + 2 + 1 + rp0->attribute_value_length * (sizeof(uint8_t)) */
/**
  * @brief This event can be generated during a "Discover Characteristics By
  *        UUID" procedure or a "Read using Characteristic UUID" procedure.
  *        During a "Discover Characteristics By UUID" procedure, attribute_value
  *        is a characteristic declaration as defined in Bluetooth Core spec
  *        (vol.3, Part G, ch. 3.3.1), index.e. it is composed by: Characteristic
  *        Properties (1 octet), Characteristic Value Handle (2 octets) and
  *        Characteristic UUID (2 or 16 octets). During a "Read using
  *        Characteristic UUID" procedure, attribute_value is the value of the
  *        characteristic.
  * @param connection_handle Connection handle related to the response
  * @param attribute_handle The handle of the attribute
  * @param attribute_value_length Length of attribute_value in octets
  * @param attribute_value The attribute value will be a characteristic
  *        declaration as defined in Bluetooth Core spec (vol.3, Part G, ch.
  *        3.3.1), when a "Discover Characteristics By UUID" has been started. It
  *        will be the value of the Characteristic if a "Read using
  *        Characteristic UUID" has been performed.
  * @retval None
  */

ble_status_t aci_gatt_clt_disc_read_char_by_uuid_resp_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gatt_clt_disc_read_char_by_uuid_resp_event_rp0 *rp0 =
    (aci_gatt_clt_disc_read_char_by_uuid_resp_event_rp0 *)buffer_in;
  aci_gatt_clt_disc_read_char_by_uuid_resp_event(rp0->connection_handle,
                                                 rp0->attribute_handle,
                                                 rp0->attribute_value_length,
                                                 rp0->attribute_value);

