zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
  return status;
}
/* aci_gatt_tx_pool_available_event */
/* Event len: 2 + 2 */
/**
  * @brief Each time BLE FW stack raises the error code @ref
  *        ble_status_insufficient_resources, aci_gatt_tx_pool_available_event()
  *        is generated as soon as the available buffer size  is greater than
  *        maximum ATT MTU.
  * @param connection_handle Connection handle related to the request
  * @param available_buffers Not used.
  * @retval None
  */

ble_status_t aci_gatt_tx_pool_available_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gatt_tx_pool_available_event_rp0 *rp0 = (aci_gatt_tx_pool_available_event_rp0 *)buffer_in;
  aci_gatt_tx_pool_available_event(rp0->connection_handle,
                                   rp0->available_buffers);

  return status;
}
/* aci_gatt_srv_confirmation_event */
/* Event len: 2 */
/**
  * @brief This event is generated when the client has sent the confirmation to a
  *        previously sent indication.
  * @param connection_handle Connection handle related to the event.
  * @retval None
  */

ble_status_t aci_gatt_srv_confirmation_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gatt_srv_confirmation_event_rp0 *rp0 = (aci_gatt_srv_confirmation_event_rp0 *)buffer_in;
  aci_gatt_srv_confirmation_event(rp0->connection_handle);

  return status;
}
/* aci_att_srv_exec_write_req_event */
/* Event len: 2 + 1 */
/**
  * @brief This event is generated when an execute write request is received from
  *        the peer. This happens when the client wants to write a long attribute
  *        (index.e. an attribute with a size greater than ATT_MTU -3) or more than
  *        one attribute in a single operation. The aci_gatt_srv_exec_write_resp
  *        command must be sent to give a response to the peer.
  * @param connection_handle Handle identifying the connection where the execute
  *        write operation has been received.
  * @param flags If 1, peer wants to execute all the queued writes. If 0, all
  *        queued writes must be discarded.
  *        Values:
  *        - 0x00: FLUSH
  *        - 0x01: EXECUTE
  * @retval None
  */

ble_status_t aci_att_srv_exec_write_req_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_att_srv_exec_write_req_event_rp0 *rp0 = (aci_att_srv_exec_write_req_event_rp0 *)buffer_in;
  aci_att_srv_exec_write_req_event(rp0->connection_handle,
                                   rp0->flags);

  return status;
}
/* aci_gatt_srv_authorize_nwk_event */
/* Event len: 2 + 2 + 1 + 2 + 1 + rp0->data_length * (sizeof(uint8_t)) */
/**
  * @brief This event is generated if authorization is needed to access the
  *        attribute value. aci_gatt_srv_authorize_resp_nwk command must be sent
  *        in response to this event.
  * @param conn_handle Connection handle to be used to identify the connection
  *        with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param attr_handle
  * @param operation_type
  *        Values:
  *        - 0x00: Read
  *        - 0x10: Write Request
  *        - 0x11: Write Command or Signed Write Command
  *        - 0x12: Prepare Write Request
  * @param attr_val_offset Offset from which the value needs to be read or write
  *        Values:
  *        - 0 ... 511
  * @param data_length Length of Data field
  * @param data The data that the client has requested to write
  * @retval None
  */

ble_status_t aci_gatt_srv_authorize_nwk_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  aci_gatt_srv_authorize_nwk_event_rp0 *rp0 = (aci_gatt_srv_authorize_nwk_event_rp0 *)buffer_in;
  aci_gatt_srv_authorize_nwk_event(rp0->conn_handle,
                                   rp0->attr_handle,
                                   rp0->operation_type,
                                   rp0->attr_val_offset,
                                   rp0->data_length,
                                   rp0->data);

  return status;
}
/* hci_le_connection_complete_event */
/* Event len: 1 + 2 + 1 + 1 + 6 + 2 + 2 + 2 + 1 */
/**
  * @brief The LE Connection Complete event indicates to both of the Hosts
  *        forming the connection that a new connection has been created. Upon
  *        the creation of the connection a connection_handle shall be assigned
  *        by the Controller, and passed to the Host in this event. If the
  *        connection establishment fails this event shall be provided to the
  *        Host that had issued the LE_Create_Connection command. This event
  *        indicates to the Host which issued a LE_Create_Connection command and
  *        received a Command status event if the connection establishment failed
  *        or was successful. The master_clock_accuracy parameter is only valid
  *        for a slave. On a master, this parameter shall be set to 0x00.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle to be used to identify the
  *        connection with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param role Role of the local device in the connection.
  *        Values:
  *        - 0x00: Master
  *        - 0x01: Slave
  * @param peer_address_type The address type of the peer device.
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  * @param peer_address Public Device Address or Random Device Address of the
  *        peer device
  * @param conn_interval Connection interval used on this connection. Time = N *
  *        1.25 msec
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_latency Slave latency for the connection in number of connection
  *        events.
  *        Values:
  *        - 0x0000 ... 0x01F3
  * @param supervision_timeout Supervision timeout for the LE Link. It shall be a
  *        multiple of 10 ms and larger than (1 + connSlaveLatency) *
  *        connInterval * 2. Time = N * 10 msec.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms)
  * @param master_clock_accuracy Master clock accuracy. Only valid for a slave.
  *        Values:
  *        - 0x00: 500 ppm
  *        - 0x01: 250 ppm
  *        - 0x02: 150 ppm
  *        - 0x03: 100 ppm
  *        - 0x04: 75 ppm
  *        - 0x05: 50 ppm
  *        - 0x06: 30 ppm
  *        - 0x07: 20 ppm
  * @retval None
  */

ble_status_t hci_le_connection_complete_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_connection_complete_event_rp0 *rp0 = (hci_le_connection_complete_event_rp0 *)buffer_in;
  hci_le_connection_complete_event(rp0->status,
                                   rp0->connection_handle,
                                   rp0->role,
                                   rp0->peer_address_type,
                                   rp0->peer_address,
                                   rp0->conn_interval,
                                   rp0->conn_latency,
                                   rp0->supervision_timeout,
                                   rp0->master_clock_accuracy);

