zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
  return status;
}
/* hci_le_advertising_report_event */
/* Event len: 1 + rp0->num_reports * (sizeof(packed_advertising_report_t)) */
/**
  * @brief The LE Advertising Report event indicates that a Bluetooth device or
  *        multiple Bluetooth devices have responded to an active scan or
  *        received some information during a passive scan. The Controller may
  *        queue these advertising reports and send information from multiple
  *        devices in one LE Advertising Report event.
  * @param num_reports Number of responses in this event.
  *        Values:
  *        - 0x01
  * @param advertising_report See @ref advertising_report_t
  * @retval None
  */

ble_status_t hci_le_advertising_report_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_advertising_report_event_rp0 *rp0 = (hci_le_advertising_report_event_rp0 *)buffer_in;
  uint8_t size = 1;
  uint32_t index;
  advertising_report_t advertising_report[HCI_MAX_PAYLOAD_SIZE / sizeof(advertising_report_t)];
  for (index = 0; index < rp0->num_reports; index++)
  {
    advertising_report[index].event_type = rp0->advertising_report[index].event_type;
    size += 1;
    advertising_report[index].address_type = rp0->advertising_report[index].address_type;
    size += 1;
    STM32WB07_06_MEMCPY((void *) advertising_report[index].address,
                   (const void *) rp0->advertising_report[index].address,
                   6);
    size += 6;
    advertising_report[index].data_length = rp0->advertising_report[index].data_length;
    size += 1;
    advertising_report[index].data = rp0->advertising_report[index].data;
    size += rp0->advertising_report[index].data_length;
    advertising_report[index].rssi = (uint8_t)buffer_in[size];
    size += 1;
  }
  hci_le_advertising_report_event(rp0->num_reports,
                                  advertising_report);

  return status;
}
/* hci_le_connection_update_complete_event */
/* Event len: 1 + 2 + 2 + 2 + 2 */
/**
  * @brief The LE Connection Update Complete event is used to indicate that the
  *        Controller process to update the connection has completed. On a slave,
  *        if no connection parameters are updated, then this event shall not be
  *        issued. On a master, this event shall be issued if the
  *        Connection_Update command was sent.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle to be used to identify the
  *        connection with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param conn_interval Connection interval used on this connection. Time = N *
  *        1.25 msec
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_latency Slave latency for the connection in number of connection
  *        events.
  *        Values:
  *        - 0x0000 ... 0x01F3
  * @param supervision_timeout Supervision timeout for the LE Link. It shall be a
  *        multiple of 10 ms and larger than (1 + connSlaveLatency) *
  *        connInterval * 2. Time = N * 10 msec.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms)
  * @retval None
  */

ble_status_t hci_le_connection_update_complete_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_connection_update_complete_event_rp0 *rp0 = (hci_le_connection_update_complete_event_rp0 *)buffer_in;
  hci_le_connection_update_complete_event(rp0->status,
                                          rp0->connection_handle,
                                          rp0->conn_interval,
                                          rp0->conn_latency,
                                          rp0->supervision_timeout);

  return status;
}
/* hci_le_read_remote_used_features_complete_event */
/* Event len: 1 + 2 + 8 */
/**
  * @brief The LE Read Remote Used Features Complete event is used to indicate
  *        the completion of the process of the Controller obtaining the used
  *        features of the remote Bluetooth device specified by the
  *        connection_handle event parameter.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle to be used to identify the
  *        connection with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param le_features Bit Mask List of used LE features. For details see LE Link
  *        Layer specification.
  * @retval None
  */

ble_status_t hci_le_read_remote_used_features_complete_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_read_remote_used_features_complete_event_rp0 *rp0 =
    (hci_le_read_remote_used_features_complete_event_rp0 *)buffer_in;
  hci_le_read_remote_used_features_complete_event(rp0->status,
                                                  rp0->connection_handle,
                                                  rp0->le_features);

  return status;
}
/* hci_le_long_term_key_request_event */
/* Event len: 2 + 8 + 2 */
/**
  * @brief The LE Long Term Key Request event indicates that the master device is
  *        attempting to encrypt or re-encrypt the link and is requesting the
  *        Long Term Key from the Host. (See [Vol 6] Part B, Section 5.1.3).
  * @param connection_handle Connection handle to be used to identify the
  *        connection with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param random_number 64-bit random number
  * @param encrypted_diversifier 16-bit encrypted diversifier
  * @retval None
  */

ble_status_t hci_le_long_term_key_request_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_long_term_key_request_event_rp0 *rp0 = (hci_le_long_term_key_request_event_rp0 *)buffer_in;
  hci_le_long_term_key_request_event(rp0->connection_handle,
                                     rp0->random_number,
                                     rp0->encrypted_diversifier);

