zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
  return status;
}
/* hci_le_data_length_change_event */
/* Event len: 2 + 2 + 2 + 2 + 2 */
/**
  * @brief The LE Data Length Change event notifies the Host of a change to
  *        either the maximum Payload length or the maximum transmission time of
  *        Data Channel PDUs in either direction. The values reported are the
  *        maximum that will actually be used on the connection following the
  *        change.
  * @param connection_handle connection_handle to be used to identify a
  *        connection.
  * @param max_tx_octets The maximum number of payload octets in a Link Layer Data
  *        Channel PDU that the local Controller will send on this connection
  *        (connEffectiveMaxTxOctets defined in [Vol 6] Part B, Section 4.5.10).
  *        Range 0x001B-0x00FB (0x0000 - 0x001A and 0x00FC - 0xFFFF Reserved for
  *        future use)
  * @param max_tx_time The maximum time that the local Controller will take to send
  *        a Link Layer Data Channel PDU on this connection (connEffectiveMaxTx-
  *        Time defined in [Vol 6] Part B, Section 4.5.10). Range 0x0148-0x0848
  *        (0x0000 - 0x0127 and 0x0849 - 0xFFFF Reserved for future use)
  * @param max_rx_octets The maximum number of payload octets in a Link Layer Data
  *        Channel PDU that the local controller expects to receive on this
  *        connection (connEfectiveMaxRxOctets defined in [Vol 6] Part B, Section
  *        4.5.10). Range 0x001B-0x00FB (0x0000 - 0x001A and 0x00FC - 0xFFFF
  *        Reserved for future use)
  * @param max_rx_time The maximum time that the local Controller expects to take
  *        to receive a Link Layer Data Channel PDU on this connection
  *        (connEffectiveMax-RxTime defined in [Vol 6] Part B, Section 4.5.10).
  *        Range 0x0148-0x0848 (0x0000 - 0x0127 and 0x0849 - 0xFFFF Reserved for
  *        future use)
  * @retval None
  */

ble_status_t hci_le_data_length_change_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_data_length_change_event_rp0 *rp0 = (hci_le_data_length_change_event_rp0 *)buffer_in;
  hci_le_data_length_change_event(rp0->connection_handle,
                                  rp0->max_tx_octets,
                                  rp0->max_tx_time,
                                  rp0->max_rx_octets,
                                  rp0->max_rx_time);

  return status;
}
/* hci_le_read_local_p256_public_key_complete_event */
/* Event len: 1 + 64 */
/**
  * @brief This event is generated when local P-256 key generation is complete.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param local_p256_public_key Local P-256 public key.
  * @retval None
  */

ble_status_t hci_le_read_local_p256_public_key_complete_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_read_local_p256_public_key_complete_event_rp0 *rp0 =
    (hci_le_read_local_p256_public_key_complete_event_rp0 *)buffer_in;
  hci_le_read_local_p256_public_key_complete_event(rp0->status,
                                                   rp0->local_p256_public_key);

  return status;
}
/* hci_le_generate_dhkey_complete_event */
/* Event len: 1 + 32 */
/**
  * @brief This event indicates that LE Diffie Hellman key generation has been
  *        completed by the Controller.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param dh_key Diffie Hellman Key
  * @retval None
  */

ble_status_t hci_le_generate_dhkey_complete_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_generate_dhkey_complete_event_rp0 *rp0 = (hci_le_generate_dhkey_complete_event_rp0 *)buffer_in;
  hci_le_generate_dhkey_complete_event(rp0->status,
                                       rp0->dh_key);

  return status;
}
/* hci_le_enhanced_connection_complete_event */
/* Event len: 1 + 2 + 1 + 1 + 6 + 6 + 6 + 2 + 2 + 2 + 1 */
/**
  * @brief The LE Enhanced Connection Complete event indicates to both of the
  *        Hosts forming the connection that a new connection has been created.
  *        Upon the creation of the connection a connection_handle shall be
  *        assigned by the Controller, and passed to the Host in this event. If
  *        the connection establishment fails, this event shall be provided to
  *        the Host that had issued the LE_Create_Connection command. If this
  *        event is unmasked and LE Connection Complete event is unmasked, only
  *        the LE Enhanced Connection Complete event is sent when a new
  *        connection has been completed. This event indicates to the Host that
  *        issued a LE_Create_Connection command and received a Command status
  *        event if the connection establishment failed or was successful. The
  *        master_clock_accuracy parameter is only valid for a slave. On a
  *        master, this parameter shall be set to 0x00.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle to be used to identify the
  *        connection with the peer device.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param role Role of the local device in the connection.
  *        Values:
  *        - 0x00: Master
  *        - 0x01: Slave
  * @param peer_address_type 0x00 Public Device Address 0x01 Random Device
  *        Address 0x02 Public Identity Address (Corresponds to Resolved Private
  *        Address) 0x03 Random (Static) Identity Address (Corresponds to
  *        Resolved Private Address)
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  *        - 0x02: Public Identity Address
  *        - 0x03: Random (Static) Identity Address
  * @param peer_address Public Device Address, Random Device Address, Public
  *        Identity Address or Random (static) Identity Address of the device to
  *        be connected.
  * @param local_resolvable_private_address Resolvable Private Address being used
  *        by the local device for this connection. This is only valid when the
  *        own_address_type is set to 0x02 or 0x03. For other own_address_type
  *        values, the Controller shall return all zeros.
  * @param peer_resolvable_private_address Resolvable Private Address being used
  *        by the peer device for this connection. This is only valid for
  *        peer_address_type 0x02 and 0x03. For other peer_address_type values,
  *        the Controller shall return all zeros.
  * @param conn_interval Connection interval used on this connection. Time = N *
  *        1.25 msec
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0x0C80 (4000.00 ms)
  * @param conn_latency Slave latency for the connection in number of connection
  *        events.
  *        Values:
  *        - 0x0000 ... 0x01F3
  * @param supervision_timeout Supervision timeout for the LE Link. It shall be a
  *        multiple of 10 ms and larger than (1 + connSlaveLatency) *
  *        connInterval * 2. Time = N * 10 msec.
  *        Values:
  *        - 0x000A (100 ms)  ... 0x0C80 (32000 ms)
  * @param master_clock_accuracy Master clock accuracy. Only valid for a slave.
  *        Values:
  *        - 0x00: 500 ppm
  *        - 0x01: 250 ppm
  *        - 0x02: 150 ppm
  *        - 0x03: 100 ppm
  *        - 0x04: 75 ppm
  *        - 0x05: 50 ppm
  *        - 0x06: 30 ppm
  *        - 0x07: 20 ppm
  * @retval None
  */

ble_status_t hci_le_enhanced_connection_complete_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_enhanced_connection_complete_event_rp0 *rp0 = (hci_le_enhanced_connection_complete_event_rp0 *)buffer_in;
  hci_le_enhanced_connection_complete_event(rp0->status,
                                            rp0->connection_handle,
                                            rp0->role,
                                            rp0->peer_address_type,
                                            rp0->peer_address,
                                            rp0->local_resolvable_private_address,
                                            rp0->peer_resolvable_private_address,
                                            rp0->conn_interval,
                                            rp0->conn_latency,
                                            rp0->supervision_timeout,
                                            rp0->master_clock_accuracy);

