zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
  return status;
}
/* hci_le_direct_advertising_report_event */
/* Event len: 1 + rp0->num_reports * (sizeof(packed_direct_advertising_report_t)) */
/**
  * @brief The LE Direct Advertising Report event indicates that directed
  *        advertisements have been received where the advertiser is using a
  *        resolvable private address for the InitA field in the ADV_DIRECT_IND
  *        PDU and the scanning_filter_policy is equal to 0x02 or 0x03, see
  *        HCI_LE_Set_Scan_Parameters. direct_address_type and Direct_Addres is
  *        the address the directed advertisements are being directed to.
  *        address_type and Address is the address of the advertiser sending the
  *        directed advertisements.
  * @param num_reports Number of responses in this event.
  *        Values:
  *        - 0x01
  * @param direct_advertising_report See @ref direct_advertising_report_t
  * @retval None
  */

ble_status_t hci_le_direct_advertising_report_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_direct_advertising_report_event_rp0 *rp0 = (hci_le_direct_advertising_report_event_rp0 *)buffer_in;
  uint8_t size = 1;
  uint32_t index;
  direct_advertising_report_t direct_advertising_report[HCI_MAX_PAYLOAD_SIZE / sizeof(direct_advertising_report_t)];
  for (index = 0; index < rp0->num_reports; index++)
  {
    direct_advertising_report[index].event_type = rp0->direct_advertising_report[index].event_type;
    size += 1;
    direct_advertising_report[index].address_type = rp0->direct_advertising_report[index].address_type;
    size += 1;
    STM32WB07_06_MEMCPY((void *) direct_advertising_report[index].address,
                   (const void *) rp0->direct_advertising_report[index].address,
                   6);
    size += 6;
    direct_advertising_report[index].direct_address_type = rp0->direct_advertising_report[index].direct_address_type;
    size += 1;
    STM32WB07_06_MEMCPY((void *) direct_advertising_report[index].direct_address,
                   (const void *) rp0->direct_advertising_report[index].direct_address, 6);
    size += 6;
    direct_advertising_report[index].rssi = rp0->direct_advertising_report[index].rssi;
    size += 1;
  }
  hci_le_direct_advertising_report_event(rp0->num_reports,
                                         direct_advertising_report);

  return status;
}
/* hci_le_phy_update_complete_event */
/* Event len: 1 + 2 + 1 + 1 */
/**
  * @brief The LE PHY Update Complete Event is used to indicate that the
  *        Controller has changed the transmitter PHY or receiver PHY in use. If
  *        the Controller changes the transmitter PHY, the receiver PHY, or both
  *        PHYs, this event shall be issued. If an LE_Set_PHY command was sent
  *        and the Controller determines that neither PHY will change as a
  *        result, it issues this event immediately.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param connection_handle connection_handle to be used to identify a
  *        connection.
  * @param tx_phy The transmitter PHY for the connection
  *        Values:
  *        - 0x01: The transmitter PHY for the connection is LE 1M
  *        - 0x02: The transmitter PHY for the connection is LE 2M
  *        - 0x03: The transmitter PHY for the connection is LE Coded
  * @param rx_phy The receiver PHY for the connection
  *        Values:
  *        - 0x01: The receiver PHY for the connection is LE 1M
  *        - 0x02: The receiver PHY for the connection is LE 2M
  *        - 0x03: The receiver PHY for the connection is LE Coded
  * @retval None
  */

ble_status_t hci_le_phy_update_complete_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_phy_update_complete_event_rp0 *rp0 = (hci_le_phy_update_complete_event_rp0 *)buffer_in;
  hci_le_phy_update_complete_event(rp0->status,
                                   rp0->connection_handle,
                                   rp0->tx_phy,
                                   rp0->rx_phy);

  return status;
}
/* hci_le_extended_advertising_report_event */
/* Event len: 1 + rp0->num_reports * (sizeof(packed_extended_advertising_report_t)) */
/**
  * @brief The LE Extended Advertising Report event indicates that one or more
  *        Bluetooth devices have responded to an active scan or have broadcast
  *        advertisements that were received during a passive scan. The
  *        Controller may coalesce multiple advertising reports from the same or
  *        different advertisers into a single LE Extended Advertising Report
  *        event, provided all the parameters from all the advertising reports
  *        fit in a single HCI event. This event shall only be generated if
  *        scanning was enabled using the LE Set Extended Scan Enable command. It
  *        reports advertising events using either legacy or extended advertising
  *        PDUs. The Controller may split the data from a single advertisement
  *        (whether one PDU or several) into several reports. If so, each report
  *        except the last shall have an event_type with a data status field of
  *        "incomplete, more data to come", while the last shall have the value
  *        "complete"; the address_type, Address, advertising_sid, primary_phy,
  *        and secondary_phy fields shall be the same in all the reports. When a
  *        scan response is received, bits 0-2 and 4 of the event type shall
  *        indicate the properties of the original advertising event. An
  *        event_type with a data status field of "incomplete, data truncated"
  *        indicates that the Controller attempted to receive an AUX_CHAIN_IND
  *        PDU but was not successful.
  * @param num_reports Number of separate reports in the event
  *        Values:
  *        - 0x01 ... 0x0A
  * @param extended_adv_report See @ref extended_advertising_report_t
  * @retval None
  */

ble_status_t hci_le_extended_advertising_report_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_extended_advertising_report_event_rp0 *rp0 = (hci_le_extended_advertising_report_event_rp0 *)buffer_in;
  uint8_t size = 1;
  uint32_t index;
  extended_advertising_report_t extended_adv_report[HCI_MAX_PAYLOAD_SIZE /
                                                    sizeof(extended_advertising_report_t)];
  for (index = 0; index < rp0->num_reports; index++)
  {
    extended_adv_report[index].event_type = rp0->extended_adv_report[index].event_type;
    size += 2;
    extended_adv_report[index].address_type = rp0->extended_adv_report[index].address_type;
    size += 1;
    STM32WB07_06_MEMCPY((void *) extended_adv_report[index].address,
                   (const void *) rp0->extended_adv_report[index].address, 6);
    size += 6;
    extended_adv_report[index].primary_phy = rp0->extended_adv_report[index].primary_phy;
    size += 1;
    extended_adv_report[index].secondary_phy = rp0->extended_adv_report[index].secondary_phy;
    size += 1;
    extended_adv_report[index].advertising_sid = rp0->extended_adv_report[index].advertising_sid;
    size += 1;
    extended_adv_report[index].tx_power = rp0->extended_adv_report[index].tx_power;
    size += 1;
    extended_adv_report[index].rssi = rp0->extended_adv_report[index].rssi;
    size += 1;
    extended_adv_report[index].periodic_advertising_interval =
      rp0->extended_adv_report[index].periodic_advertising_interval;
    size += 2;
    extended_adv_report[index].direct_address_type =
      rp0->extended_adv_report[index].direct_address_type;
    size += 1;
    STM32WB07_06_MEMCPY((void *) extended_adv_report[index].direct_address,
                   (const void *) rp0->extended_adv_report[index].direct_address, 6);
    size += 6;
    extended_adv_report[index].data_length = rp0->extended_adv_report[index].data_length;
    size += 1;
    extended_adv_report[index].data = rp0->extended_adv_report[index].data;
    size += rp0->extended_adv_report[index].data_length;
  }
  hci_le_extended_advertising_report_event(rp0->num_reports,
                                           extended_adv_report);

