zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
  return status;
}
/* hci_le_periodic_advertising_sync_established_event */
/* Event len: 1 + 2 + 1 + 1 + 6 + 1 + 2 + 1 */
/**
  * @brief The LE Periodic Advertising Report event indicates that the Controller
  *        has received a Periodic Advertising packet. The sync_handle parameter
  *        indicates the identifier for the periodic advertisements specified by
  *        the Advertising SID subfield of the ADI field in the ADV_EXT_IND PDU.
  *        The Controller may split the data from a single periodic advertisement
  *        (whether one PDU or several) into several reports. If so, each report
  *        except the last shall have a data_status of "incomplete, more data to
  *        come", while the last shall have the value "complete". A data_status
  *        of "incomplete, data truncated" indicates that the Controller
  *        attempted to receive an AUX_CHAIN_IND PDU but was not successful. The
  *        Unused parameter shall be set to 0xFF by the Controller and ignored by
  *        the Host.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param sync_handle Sync handle that identifies the synchronization
  *        information about the periodic advertising train.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param advertising_sid Advertising SID subfield in the ADI field of the PDU
  *        Values:
  *        - 0x00 ... 0x0F: Value of the Advertising SID subfield in the ADI field of the PDU
  *        - 0x10 ... 0xFF: Reserved for future use
  * @param advertiser_address_type Advertising Address Type
  *        Values:
  *        - 0x00: Public Device Address or Public Identity Address
  *        - 0x01: Random Device Address or Random (static) Identity Address
  *        - 0x02: Public Identity Address (corresponds to Resolved Private Address)
  *        - 0x03: Random (static) Identity Address (corresponds to Resolved Private Address)
  *        - 0x04 ... 0xFF: Reserved for future use
  * @param advertising_address Public Device Address, Random Device Address,
  *        Public Identity Address, or Random (static) Identity Address of the
  *        advertiser
  * @param advertiser_phy Advertiser PHY
  *        Values:
  *        - 0x01: Advertiser PHY is LE 1M
  *        - 0x02: Advertiser PHY is LE 2M
  *        - 0x03: Advertiser PHY is LE Coded
  *        - 0x04 ... 0xFF: Reserved for future use
  * @param periodic_advertising_interval Periodic Advertising Interval Time = N *
  *        1.25 ms Time Range: 7.5 ms to 81.91875 s
  *        Values:
  *        - 0x0006 ... 0xFFFF: Periodic Advertising Interval
  * @param advertiser_clock_accuracy Advertiser Clock Accuracy
  *        Values:
  *        - 0x00: 500 ppm
  *        - 0x01: 250 ppm
  *        - 0x02: 150 ppm
  *        - 0x03: 100 ppm
  *        - 0x04: 75 ppm
  *        - 0x05: 50 ppm
  *        - 0x06: 30 ppm
  *        - 0x07: 20 ppm
  *        - 0x08 ... 0xFF: Reserved for future use
  * @retval None
  */

ble_status_t hci_le_periodic_advertising_sync_established_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_periodic_advertising_sync_established_event_rp0 *rp0 =
    (hci_le_periodic_advertising_sync_established_event_rp0 *)buffer_in;
  hci_le_periodic_advertising_sync_established_event(rp0->status,
                                                     rp0->sync_handle,
                                                     rp0->advertising_sid,
                                                     rp0->advertiser_address_type,
                                                     rp0->advertising_address,
                                                     rp0->advertiser_phy,
                                                     rp0->periodic_advertising_interval,
                                                     rp0->advertiser_clock_accuracy);

  return status;
}
/* hci_le_periodic_advertising_report_event */
/* Event len: 2 + 1 + 1 + 1 + 1 + 1 + rp0->data_length * (sizeof(uint8_t)) */
/**
  * @brief The LE Periodic Advertising Report event indicates that the Controller
  *        has received a Periodic Advertising packet. The sync_handle parameter
  *        indicates the identifier for the periodic advertisements specified by
  *        the Advertising SID subfield of the ADI field in the ADV_EXT_IND PDU.
  *        The Controller may split the data from a single periodic advertisement
  *        (whether one PDU or several) into several reports. If so, each report
  *        except the last shall have a data_status of "incomplete, more data to
  *        come", while the last shall have the value "complete". A data_status
  *        of "incomplete, data truncated" indicates that the Controller
  *        attempted to receive an AUX_CHAIN_IND PDU but was not successful. The
  *        Unused parameter shall be set to 0xFF by the Controller and ignored by
  *        the Host.
  * @param sync_handle Sync handle that identifies the synchronization
  *        information about the periodic advertising train.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param tx_power TX Power. Units: dBm
  *        Values:
  *        - 127: NA
  *        - -127 ... 126
  * @param rssi RSSI value Units: dBm
  *        Values:
  *        - 127: RSSI is not available
  *        - -127 ... 20: RSSI value
  * @param cte_type
  *        Values:
  *        - 0x00: AoA Constant Tone Extension
  *        - 0x01: AoD Constant Tone Extension with 1 microsecond slots
  *        - 0x02: AoD Constant Tone Extension with 2 microseconds slots
  *        - 0xFF: No Constant Tone Extension
  * @param data_status Data status
  *        Values:
  *        - 0x00: Data complete
  *        - 0x01: Data incomplete, more data to come
  *        - 0x02: Data incomplete, data truncated, no more to come
  *        - 0x03 ... 0xFF: Reserved for future use
  * @param data_length Length of the Data field
  *        Values:
  *        - 0 ... 247: Length of the Data field
  *        - 248 ... 255: Reserved for future use
  * @param data Data received from a Periodic Advertising packet
  * @retval None
  */

ble_status_t hci_le_periodic_advertising_report_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_periodic_advertising_report_event_rp0 *rp0 = (hci_le_periodic_advertising_report_event_rp0 *)buffer_in;
  hci_le_periodic_advertising_report_event(rp0->sync_handle,
                                           rp0->tx_power,
                                           rp0->rssi,
                                           rp0->cte_type,
                                           rp0->data_status,
                                           rp0->data_length,
                                           rp0->data);

