zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
  return status;
}
/* hci_le_periodic_advertising_sync_lost_event */
/* Event len: 2 */
/**
  * @brief The LE Periodic Advertising Sync Lost event indicates that the
  *        Controller has not received a Periodic Advertising packet identified
  *        by sync_handle within the timeout period.
  * @param sync_handle Sync handle that identifies the synchronization
  *        information about the periodic advertising train.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval None
  */

ble_status_t hci_le_periodic_advertising_sync_lost_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_periodic_advertising_sync_lost_event_rp0 *rp0 = (hci_le_periodic_advertising_sync_lost_event_rp0 *)buffer_in;
  hci_le_periodic_advertising_sync_lost_event(rp0->sync_handle);

  return status;
}
/* hci_le_scan_timeout_event */
/* Event len: 0 */
/**
  * @brief The LE Scan Timeout event indicates that scanning has ended because
  *        the duration has expired. This event shall only be generated if
  *        scanning was enabled using the LE Set Extended Scan Enable command.
  * @retval None
  */

ble_status_t hci_le_scan_timeout_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  hci_le_scan_timeout_event();

  return status;
}
/* hci_le_advertising_set_terminated_event */
/* Event len: 1 + 1 + 2 + 1 */
/**
  * @brief The LE Advertising Set Terminated event indicates that the Controller
  *        has terminated advertising in the advertising sets specified by the
  *        advertising_handle parameter. This event shall be generated every time
  *        connectable advertising in an advertising set results in a connection
  *        being created. This event shall only be generated if advertising was
  *        enabled using the LE Set Extended Advertising Enable command. The
  *        connection_handle parameter is only valid when advertising ends
  *        because a connection was created. If the
  *        max_extended_advertising_events parameter in the
  *        LE_Set_Extended_Advertising_Enable command was non-zero, the
  *        num_completed_extended_advertising_events parameter shall be set to
  *        the number of completed extended advertising events the Controller had
  *        transmitted when either the duration elapsed or the maximum number of
  *        extended advertising events was reached; otherwise it shall be set to
  *        zero. If advertising has terminated as a result of the advertising
  *        duration elapsing, the status parameter shall be set to the error code
  *        Advertising Timeout (0x3C). If advertising has terminated because the
  *        max_extended_advertising_events was reached, the status parameter
  *        shall be set to the error code Limit Reached (0x43).
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param advertising_handle Advertising handle in which advertising has ended
  *        Values:
  *        - 0x00 ... 0xEF: advertising_handle in which advertising has ended
  *        - 0xF0 ... 0xFF: Reserved for future use
  * @param connection_handle connection_handle to be used to identify a
  *        connection.
  * @param num_completed_extended_advertising_events Number of completed extended
  *        advertising events transmitted by the Controller
  * @retval None
  */

ble_status_t hci_le_advertising_set_terminated_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_advertising_set_terminated_event_rp0 *rp0 = (hci_le_advertising_set_terminated_event_rp0 *)buffer_in;
  hci_le_advertising_set_terminated_event(rp0->status,
                                          rp0->advertising_handle,
                                          rp0->connection_handle,
                                          rp0->num_completed_extended_advertising_events);

  return status;
}
/* hci_le_scan_request_received_event */
/* Event len: 1 + 1 + 6 */
/**
  * @brief The LE Scan Request Received event indicates that a SCAN_REQ PDU or an
  *        AUX_SCAN_REQ PDU has been received by the advertiser. The request
  *        contains a device address from a scanner that is allowed by the
  *        advertising filter policy. The advertising set is identified by
  *        advertising_handle. This event shall only be generated if advertising
  *        was enabled using the LE Set Extended Advertising Enable command. The
  *        scanner_address_type and scanner_address indicates the type of the
  *        address and the address of the scanner device.
  * @param advertising_handle It is used to identify an advertising set
  *        Values:
  *        - 0x00 ... 0xEF: Used to identify an advertising set
  *        - 0xF0 ... 0xFF: Reserved for future use
  * @param scanner_address_type Scanner address  type
  *        Values:
  *        - 0x00: Public Device Address
  *        - 0x01: Random Device Address
  *        - 0x02: Public Identity Address (corresponds to Resolved Private Address)
  *        - 0x03: Random (static) Identity Address (corresponds to Resolved Private Address)
  *        - 0x04 ... 0xFF: Reserved for future use
  * @param scanner_address Public Device Address, Random Device Address, Public
  *        Identity Address or Random (static) Identity Address of the
  *        advertising device
  * @retval None
  */

ble_status_t hci_le_scan_request_received_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_scan_request_received_event_rp0 *rp0 = (hci_le_scan_request_received_event_rp0 *)buffer_in;
  hci_le_scan_request_received_event(rp0->advertising_handle,
                                     rp0->scanner_address_type,
                                     rp0->scanner_address);

  return status;
}
/* hci_le_channel_selection_algorithm_event */
/* Event len: 2 + 1 */
/**
  * @brief The LE Channel Selection Algorithm Event indicates which channel
  *        selection algorithm is used on a data channel connection (see [Vol 6]
  *        Part B, Section 4.5.8).
  * @param connection_handle connection_handle to be used to identify a
  *        connection.
  * @param channel_selection_algorithm Channel selection algorithm to be  used on
  *        a data channel connection
  *        Values:
  *        - 0x00: LE Channel Selection Algorithm #1 is used
  *        - 0x01: LE Channel Selection Algorithm #2 is used
  *        - 0x02 ... 0xFF: Reserved for future use
  * @retval None
  */

ble_status_t hci_le_channel_selection_algorithm_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_channel_selection_algorithm_event_rp0 *rp0 = (hci_le_channel_selection_algorithm_event_rp0 *)buffer_in;
  hci_le_channel_selection_algorithm_event(rp0->connection_handle,
                                           rp0->channel_selection_algorithm);

