zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
  return status;
}
/* hci_le_connectionless_iq_report_event */
/* Event len: 2 + 1 + 2 + 1 + 1 + 1 + 1 + 2 + 1 + rp0->sample_count * (sizeof(packed_samples_t)) */
/**
  * @brief The HCI_LE_Connectionless_IQ_Report event is used by the Controller to
  *        report IQ information from the Constant Tone Extension of a received
  *        advertising packet forming part of the periodic advertising train
  *        identified by sync_handle and to report IQ information from the
  *        Constant Tone Extension of a received Test Mode packet (see Section
  *        7.8.28). The index of the channel on which the packet was received,
  *        the RSSI of the packet (excluding the Constant Tone Extension), the ID
  *        of the antenna on which this was measured, the type of Constant Tone
  *        Extension, the value of paEventCounter, and the IQ samples of the
  *        Constant Tone Extension of the advertisement are reported in the
  *        corresponding parameters. For any given sample, either both or neither
  *        of i_sample[index] and q_sample[index] shall equal 0x80. The slot_durations
  *        parameter specifies the sampling rate used by the Controller. The
  *        packet_status parameter indicates whether the received packet had a
  *        valid CRC and, if not, whether the Controller has determined the
  *        position and size of the Constant Tone Extension using the Length and
  *        CTETime fields. Note: A Controller is not required to generate this
  *        event for packets that have a bad CRC. The Constant Tone Extension
  *        format is defined in [Vol 6] Part B, Section 2.5.1. If the PDU
  *        contains AdvData, then the HCI_LE_Periodic_Advertising_Report event
  *        shall be generated before this event. The Controller is not required
  *        to generate this event for a Constant Tone Extension with a type that
  *        it does not support. This event is also used by the Controller to
  *        report that it has insufficient resources to report IQ samples for all
  *        received Constant Tone Extensions and has failed to sample at least
  *        once. In this case packet_status shall be set to 0xFF and sample_count
  *        to 0x00.
  * @param sync_handle sync_handle identifying the periodic advertising train.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  *        - 0x0FFF: TEST_SYNC_HANDLE
  * @param channel_index 0x25-0x27 can be used only for packets generated during
  *        test modes.
  *        Values:
  *        - 0x00 ... 0x27: The index of the channel on which the packet was received.
  * @param rssi RSSI of the packet. Units: 0.1 dBm.
  *        Values:
  *        - -1270 ... 200
  * @param rssi_antenna_id Antenna ID
  * @param cte_type Type of Constant Tone Extension.
  *        Values:
  *        - 0x00: AoA_CTE
  *        - 0x01: AoD_CTE_1us
  *        - 0x02: AoD_CTE_2us
  * @param slot_durations Sampling rate used by the Controller.
  *        Values:
  *        - 0x01: CTE_SLOT_1us
  *        - 0x02: CTE_SLOT_2us
  * @param packet_status It indicates whether the received packet had a valid CRC
  *        and, if not, whether the Controller has determined the position and
  *        size of the Constant Tone Extension using the Length and CTETime
  *        fields. 0x00 - CRC was correct;  0x01 - CRC was incorrect and the
  *        Length and CTETime fields of the packet were used to determine
  *        sampling points;  0x02 - CRC was incorrect but the Controller has
  *        determined the position and length of the Constant Tone Extension in
  *        some other way;  0xFF - Insufficient resources to sample
  *        (channel_index, cte_type, and slot_durations invalid).
  *        Values:
  *        - 0x00: CRC_OK
  *        - 0x01: CRC_ERROR_1
  *        - 0x02: CRC_ERROR_2
  *        - 0xFF: NO_SAMPLES
  * @param periodic_event_counter The value of paEventCounter (see [Vol 6] Part
  *        B, Section 4.4.2.1) for the reported AUX_SYNC_IND PDU
  * @param sample_count Total number of sample pairs (there shall be the same
  *        number of I samples and Q samples). Note: This number is dependent on
  *        the switch and sample slot durations used.
  *        Values:
  *        - 0x00
  *        - 0x09 ... 0x52
  * @param Samples See @ref samples_t
  * @retval None
  */

ble_status_t hci_le_connectionless_iq_report_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_connectionless_iq_report_event_rp0 *rp0 = (hci_le_connectionless_iq_report_event_rp0 *)buffer_in;
  uint8_t size = 12;
  uint32_t index;
  samples_t Samples[HCI_MAX_PAYLOAD_SIZE / sizeof(samples_t)];
  for (index = 0; index < rp0->sample_count; index++)
  {
    Samples[index].i_sample = rp0->Samples[index].i_sample;
    size += 1;
    Samples[index].q_sample = rp0->Samples[index].q_sample;
    size += 1;
  }
  hci_le_connectionless_iq_report_event(rp0->sync_handle,
                                        rp0->channel_index,
                                        rp0->rssi,
                                        rp0->rssi_antenna_id,
                                        rp0->cte_type,
                                        rp0->slot_durations,
                                        rp0->packet_status,
                                        rp0->periodic_event_counter,
                                        rp0->sample_count,
                                        Samples);

  return status;
}
/* hci_le_connection_iq_report_event */
/* Event len: 2 + 1 + 1 + 2 + 1 + 1 + 1 + 1 + 2 + 1 + rp0->sample_count * (sizeof(packed_samples_t)) */
/**
  * @brief The HCI_LE_Connection_IQ_Report event is used by the Controller to
  *        report the IQ samples from the Constant Tone Extension of a received
  *        packet (see [Vol 6] Part B, Section 2.4.2.26). The connection_handle
  *        parameter identifies the connection that corresponds to the reported
  *        information. The receiver PHY, the index of the data channel, the RSSI
  *        value of the packet (excluding the Constant Tone Extension), the ID of
  *        the antenna on which this was measured, the type of Constant Tone
  *        Extension, the value of connEventCounter, and the IQ samples of the
  *        Constant Tone Extension of the received packet are reported in the
  *        corresponding parameters. For any given sample, either both or neither
  *        of i_sample[index] and q_sample[index] shall equal 0x80. The slot_durations
  *        parameter specifies the sampling rate used by the Controller. The
  *        packet_status parameter indicates whether the received packet had a
  *        valid CRC and, if not, whether the Controller has determined the
  *        position and size of the Constant Tone Extension using the Length and
  *        CTETime fields. Note: A Controller is not required to generate this
  *        event for packets that have a bad CRC. This event is also used by the
  *        Controller to report that it has insufficient resources to report IQ
  *        samples for all received Constant Tone Extensions and has failed to
  *        sample at least once. In this case packet_status shall be set to 0xFF
  *        and sample_count to 0x00. The Constant Tone Extension format is
  *        defined in [Vol 6] Part B, Section 2.1.5.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param rx_phy
  *        Values:
  *        - 0x01: The receiver PHY for the connection is LE 1M
  *        - 0x02: The receiver PHY for the connection is LE 2M
  * @param data_channel_index
  *        Values:
  *        - 0x00 ... 0x24: The index of the data channel on which the Data Physical Channel PDU was received.
  * @param rssi RSSI of the packet. Units: 0.1 dBm.
  *        Values:
  *        - -1270 ... 200
  * @param rssi_antenna_id ID of the antenna on which the RSSI is measured
  * @param cte_type
  *        Values:
  *        - 0x00: AoA Constant Tone Extension
  *        - 0x01: AoD Constant Tone Extension with 1 microsecond slots
  *        - 0x02: AoD Constant Tone Extension with 2 microseconds slots
  * @param slot_durations Sampling rate used by the Controller.
  *        Values:
  *        - 0x01: CTE_SLOT_1us
  *        - 0x02: CTE_SLOT_2us
  * @param packet_status
  *        Values:
  *        - 0x00: CRC was correct
  *        - 0x01: CRC was incorrect and the Length and CTETime fields of the packet were used to determine
  *                sampling points
  *        - 0x02: CRC was incorrect but the Controller has determined the position and length of the
  *                Constant Tone Extension in some other way
  *        - 0xFF: Insufficient resources to sample (channel_index, cte_type, and slot_durations invalid).
  * @param connection_event_counter The value of connEventCounter (see [Vol 6]
  *        Part B, Section 4.5.1) for the reported PDU
  * @param sample_count Total number of sample pairs.
  *        Values:
  *        - 0x00
  *        - 0x09 ... 0x52
  * @param Samples See @ref samples_t
  * @retval None
  */

ble_status_t hci_le_connection_iq_report_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_connection_iq_report_event_rp0 *rp0 = (hci_le_connection_iq_report_event_rp0 *)buffer_in;
  uint8_t size = 13;
  uint32_t index;
  samples_t Samples[HCI_MAX_PAYLOAD_SIZE / sizeof(samples_t)];
  for (index = 0; index < rp0->sample_count; index++)
  {
    Samples[index].i_sample = rp0->Samples[index].i_sample;
    size += 1;
    Samples[index].q_sample = rp0->Samples[index].q_sample;
    size += 1;
  }
  hci_le_connection_iq_report_event(rp0->connection_handle,
                                    rp0->rx_phy,
                                    rp0->data_channel_index,
                                    rp0->rssi,
                                    rp0->rssi_antenna_id,
                                    rp0->cte_type,
                                    rp0->slot_durations,
                                    rp0->packet_status,
                                    rp0->connection_event_counter,
                                    rp0->sample_count,
                                    Samples);

