zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
  return status;
}
/* hci_le_cte_request_failed_event */
/* Event len: 1 + 2 */
/**
  * @brief This event is used by the Controller to report an issue following a
  *        request to a peer device to reply with a packet containing an
  *        LL_CTE_RSP PDU and a Constant Tone Extension. It shall be generated if
  *        the packet containing the LL_CTE_RSP PDU sent in response did not
  *        contain a Constant Tone Extension or if the peer rejected the request.
  *        It shall not be generated if the packet containing the LL_CTE_RSP PDU
  *        had a CRC error or if the procedure response timeout timer (see [Vol
  *        6] Part B, Section 5.2) expired.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @retval None
  */

ble_status_t hci_le_cte_request_failed_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_cte_request_failed_event_rp0 *rp0 = (hci_le_cte_request_failed_event_rp0 *)buffer_in;
  hci_le_cte_request_failed_event(rp0->status,
                                  rp0->connection_handle);

  return status;
}
/* hci_le_periodic_advertising_sync_transfer_received_event */
/* Event len: 1 + 2 + 2 + 2 + 1 + 1 + 6 + 1 + 2 + 1 */
/**
  * @brief The HCI_LE_Periodic_Advertising_Sync_Transfer_Received event is used
  *        by the Controller to report that it has received periodic advertising
  *        synchronization information from the device referred to by the
  *        connection_handle parameter and either successfully synchronized to
  *        the periodic advertising train or timed out while attempting to
  *        synchronize. The status will be zero if it successfully synchronized
  *        and non-zero otherwise. The service_data value is provided by the Host
  *        of the device sending the information. The sync_handle identifies the
  *        periodic advertising in subsequent commands and events and shall be
  *        assigned by the Controller. The remaining parameters provide
  *        information about the periodic advertising (see Section 7.7.65.14). If
  *        status is non-zero, all parameter values are valid except sync_handle,
  *        which the Host shall ignore. Note: If the Controller is already
  *        synchronized to the periodic advertising train described in the
  *        received information, no event will be generated.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param service_data A value provided by the peer device
  * @param sync_handle Sync handle that identifies the synchronization
  *        information about the periodic advertising train.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param advertising_sid
  *        Values:
  *        - 0x00 ... 0x0F: Value of the Advertising SID used to advertise the periodic advertising
  * @param advertiser_address_type
  *        Values:
  *        - 0x00: Public Device Address or Public Identity Address
  *        - 0x01: Random Device Address or Random (static) Identity Address
  *        - 0x02: Public Identity Address (corresponds to Resolved Private Address)
  *        - 0x03: Random (static) Identity Address (corresponds to Resolved Private Address)
  * @param advertising_address Public Device Address, Random Device Address,
  *        Public Identity Address, or Random (static) Identity Address of the
  *        advertiser
  * @param advertiser_phy
  *        Values:
  *        - 0x01: Advertiser PHY is LE 1M
  *        - 0x02: Advertiser PHY is LE 2M
  *        - 0x03: Advertiser PHY is LE Coded
  * @param periodic_advertising_interval Periodic advertising interval. Time = N
  *        * 1.25 ms; Time Range: 7.5ms to 81.91875 s.
  *        Values:
  *        - 0x0006 (7.50 ms)  ... 0xFFFF (NaN) : Periodic advertising interval
  * @param advertiser_clock_accuracy Advertiser Clock Accuracy
  *        Values:
  *        - 0x00: 500 ppm
  *        - 0x01: 250 ppm
  *        - 0x02: 150 ppm
  *        - 0x03: 100 ppm
  *        - 0x04: 75 ppm
  *        - 0x05: 60 ppm
  *        - 0x06: 30 ppm
  *        - 0x07: 20 ppm
  * @retval None
  */

ble_status_t hci_le_periodic_advertising_sync_transfer_received_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_periodic_advertising_sync_transfer_received_event_rp0 *rp0 =
    (hci_le_periodic_advertising_sync_transfer_received_event_rp0 *)buffer_in;
  hci_le_periodic_advertising_sync_transfer_received_event(rp0->status,
                                                           rp0->connection_handle,
                                                           rp0->service_data,
                                                           rp0->sync_handle,
                                                           rp0->advertising_sid,
                                                           rp0->advertiser_address_type,
                                                           rp0->advertising_address,
                                                           rp0->advertiser_phy,
                                                           rp0->periodic_advertising_interval,
                                                           rp0->advertiser_clock_accuracy);

  return status;
}
/* hci_le_path_loss_threshold_event */
/* Event len: 2 + 1 + 1 */
/**
  * @brief Report a path loss threshold crossing on the ACL connection identified
  *        by the connection_handle parameter.
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param current_path_loss Current path loss (always zero or positive). Units:
  *        dB.
  *        Values:
  *        - 255: NA
  *        - 0 ... 254
  * @param zone_entered The zone_entered parameter indicates which zone was
  *        entered.
  *        Values:
  *        - 0x00: LOW_ZONE
  *        - 0x01: MIDDLE_ZONE
  *        - 0x02: HIGH_ZONE
  * @retval None
  */

