zdavatz/fp-sns-stbox1/Middlewares/ST/STM32WB07_06/hci/stm32wb07_06_events.c
ble_status_t hci_le_path_loss_threshold_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_path_loss_threshold_event_rp0 *rp0 = (hci_le_path_loss_threshold_event_rp0 *)buffer_in;
  hci_le_path_loss_threshold_event(rp0->connection_handle,
                                   rp0->current_path_loss,
                                   rp0->zone_entered);

  return status;
}
/* hci_le_transmit_power_reporting_event */
/* Event len: 1 + 2 + 1 + 1 + 1 + 1 + 1 */
/**
  * @brief Report the transmit power level on the ACL connection identified by
  *        the connection_handle parameter.
  * @param status For standard error codes see Bluetooth specification, Vol. 2,
  *        part D. For proprietary error code refer to Error codes section
  * @param connection_handle Connection handle that identifies the connection.
  *        Values:
  *        - 0x0000 ... 0x0EFF
  * @param reason The reason why the event was sent and the device whose transmit
  *        power level is being reported. - 0x00: Local transmit power changed -
  *        0x01: Remote transmit power changed - 0x02:
  *        HCI_LE_Read_Remote_Transmit_Power_Level command completed
  *        Values:
  *        - 0x00: LOCAL_TX_POWER_CHANGE
  *        - 0x01: REMOTE_TX_POWER_CHANGE
  *        - 0x02: READ_REMOTE_TX_POWER_COMPLETE
  * @param phy PHY associated with the connection  (not necessarily the currently
  *        used one).
  *        Values:
  *        - 0x01: LE_1M_PHY
  *        - 0x02: LE_2M_PHY
  *        - 0x03: LE_CODED_PHY_S8
  *        - 0x04: LE_CODED_PHY_S2
  * @param transmit_power_level The transmit power level for the PHY (dBm).
  *        Values:
  *        - 126: POWER_NOT_MANAGED
  *        - 127: POWER_NA
  *        - -127 ... 20
  * @param Transmit_Power_Level_Flag It indicates whether the transmit power
  *        level that is being reported has reached its minimum and/or maximum
  *        level. Transmit_Power_Level_Flag shall be ignored if the
  *        transmit_power_level parameter is set to 0x7E or 0x7F.
  *        Flags:
  *        - 0x01: MIN_TX_POWER_BIT
  *        - 0x02: MAX_TX_POWER_BIT
  * @param delta The Delta parameter is set to the change in power level for the
  *        transmitter being reported, whenever it changes its transmit power
  *        level. Delta shall be ignored if the transmit_power_level parameter is
  *        set to 0x7E.
  *        Values:
  *        - 127: NA
  *        - 0 ... 126
  * @retval None
  */

ble_status_t hci_le_transmit_power_reporting_event_process(uint8_t *buffer_in)
{
  ble_status_t status = BLE_STATUS_SUCCESS;
  /* Input params */
  hci_le_transmit_power_reporting_event_rp0 *rp0 = (hci_le_transmit_power_reporting_event_rp0 *)buffer_in;
  hci_le_transmit_power_reporting_event(rp0->status,
                                        rp0->connection_handle,
                                        rp0->reason,
                                        rp0->phy,
                                        rp0->transmit_power_level,
                                        rp0->Transmit_Power_Level_Flag,
                                        rp0->delta);

  return status;
}
